OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/******************************************************************************
 *                                                                          
 * Copyright (c) 2008 Nuvoton Technology. All rights reserved.             
 *                                                                         
 * FILENAME
 *     NUC900_reg.h
 *
 * VERSION
 *     1.0
 *
 * DESCRIPTION
 *     This file contains the general register map of Nuvoton NUC900 processor. 
 *     Some registers are not defined for specific processor.
 *     
 *
 * HISTORY
 *     2008-06-19	Ver 1.0 Created by Min-Nan Cheng
 *
 * REMARK
 *     None
 *     
 ******************************************************************************/
#ifndef _NUC970_H
#define _NUC970_H

/*
   Register map
*/
#define    GCR_BA    0xB0000000 /* Global Control */
#define    CLK_BA    0xB0000200 /* Clock Control */
#define    EBI_BA    0xB0001000 /* EBI Control */
#define    SDIC_BA   0xB0001800 /* SDRAM (SDR/DDR/DDR2) Control */
#define    EMC0_BA   0xB0002000 /* Ethernet MAC 0 Control */
#define    EMC1_BA   0xB0003000 /* Ethernet MAC 1 Control */
#define    GDMA_BA   0xB0004000 /* GDMA control */
#define    USBH_BA   0xB0005000 /* USB Host EHCI Control */
#define    USBD_BA   0xB0006000 /* USB Device Control */
#define    USBO_BA   0xB0007000 /* OHCI USH OHCI Control */
#define    LCM_BA    0xB0008000 /* Display, LCM Interface */
#define    ACTL_BA   0xB0009000 /* Audio Control */
#define    JPEG_BA   0xB000A000 /* JPEG Engine Control */
#define    GE_BA     0xB000B000 /* 2-D Graphic Engine */
#define    SDH_BA    0xB000C000 /* SD/SDIO Host Controller */
#define    FMI_BA    0xB000D000 /* Flash Memory Card Interface */
#define    CAP_BA    0xB000E000 /* Sensor (Capture) Interface Control */
#define    CRPT_BA   0xB000F000 /* Crypto Engine Control */
#define    UART0_BA  0xB8000000 /* UART0 Control (High-Speed UART) */
#define    UART1_BA  0xB8000100 /* UART1 Control (High-Speed UART) */
#define    UART2_BA  0xB8000200 /* UART2 Control (console) */
#define    UART3_BA  0xB8000300 /* UART3 Control (micro-printer) */
#define    UART4_BA  0xB8000400 /* UART4 Control (High-Speed UART) */
#define    UART5_BA  0xB8000500 /* UART5 Control (console) */
#define    UART6_BA  0xB8000600 /* UART6 Control (High-Speed UART) */
#define    UART7_BA  0xB8000700 /* UART7 Control (console) */
#define    UART8_BA  0xB8000800 /* UART8 Control (High-Speed UART) */
#define    TMR_BA    0xB8001000 /* Timer */
#define    WDT_BA    0xB8001800 /* Watch Dog Timer */
#define    WWDT_BA   0xB8001900 /* Windows Watch Dog Timer */
#define    AIC_BA    0xB8002000 /* Interrupt Controller */
#define    GPIO_BA   0xB8003000 /* GPIO Control */
#define    RTC_BA    0xB8004000 /* Real Time Clock Control */
#define    SC0_BA    0xB8005000 /* Smart Card 0 Control */
#define    SC1_BA    0xB8005400 /* Smart Card 1 Control */
#define    I2C0_BA   0xB8006000 /* I2C 0 Control */
#define    I2C1_BA   0xB8006100 /* I2C 1 Control */
#define    USI_BA   0xB8006200 /* Universal Serial Interface 0 */
#define    USI0_BA   0xB8006200 /* Universal Serial Interface 0 */
#define    USI1_BA   0xB8006300 /* Universal Serial Interface 1 */
#define    PWM_BA    0xB8007000 /* Pulse Width Modulation (PWM) Control */
#define    KPI_BA    0xB8008000 /* Keypad Interface Control */
#define    PS2_BA    0xB8009000 /* PS2 Interface Control */
#define    ADC_BA    0xB800A000 /* ADC Control */
#define    CAN0_BA   0xB800B000 /* CAN 0 Control */
#define    CAN1_BA   0xB800B400 /* CAN 1 Control */
#define    OTP_BA    0xB800C000 /* OTP Control */
#define    IROM_BA   0xFFFF0000 /* Internal Boot ROM Space */
 
/*                                                             
  Global Control Registers  
*/
#define    REG_PDID     	(GCR_BA+0x000)  /* Product Identifier Register */
#define    REG_PWRON		(GCR_BA+0x004)  /* Power-On Setting Register */
#define    REG_ARBCON		(GCR_BA+0x008)  /* Arbitration Control Register */
#define    REG_LVRDCR 		(GCR_BA+0x020)  /* Low Voltage Reset & Detect Control Register */
#define    REG_MISCFCR  	(GCR_BA+0x030)  /* Miscellaneous Function Control Register */
#define    REG_MISCIER 		(GCR_BA+0x040)  /* Miscellaneous Interrupt Enable Register */
#define    REG_MISCISR 		(GCR_BA+0x044)  /* Miscellaneous Interrupt Status Register */
#define    REG_ROMSUM0 		(GCR_BA+0x048)  /* Internal ROM BIST Checksum Register 0 */
#define    REG_ROMSUM1 		(GCR_BA+0x04C)  /* Internal ROM BIST Checksum Register 1 */
#define    REG_WKUPSER		(GCR_BA+0x058)  /* System Wakeup Source Enable Register */
#define    REG_WKUPSSR		(GCR_BA+0x05C)  /* System Wakeup Source Status Register */
#define    REG_AHBIPRST		(GCR_BA+0x060)  /* AHB IP Reset Control Register */
#define    REG_APBIPRST0	(GCR_BA+0x064)  /* APB IP Reset Control Register 0 */
#define    REG_APBIPRST1	(GCR_BA+0x068)  /* APB IP Reset Control Register 1 */
#define    REG_RSTSTS		(GCR_BA+0x06C)  /* Reset Source Active Status Register */
#define    REG_MFP_GPA_L	(GCR_BA+0x070)  /* GPIOA Low Byte Multiple Function Control Register */
#define    REG_MFP_GPA_H	(GCR_BA+0x074)  /* GPIOA High Byte Multiple Function Control Register */
#define    REG_MFP_GPB_L	(GCR_BA+0x078)  /* GPIOB Low Byte Multiple Function Control Register */
#define    REG_MFP_GPB_H	(GCR_BA+0x07C)  /* GPIOB High Byte Multiple Function Control Register */
#define    REG_MFP_GPC_L	(GCR_BA+0x080)  /* GPIOC Low Byte Multiple Function Control Register */
#define    REG_MFP_GPC_H	(GCR_BA+0x084)  /* GPIOC High Byte Multiple Function Control Register */
#define    REG_MFP_GPD_L	(GCR_BA+0x088)  /* GPIOD Low Byte Multiple Function Control Register */
#define    REG_MFP_GPD_H	(GCR_BA+0x08C)  /* GPIOD High Byte Multiple Function Control Register */
#define    REG_MFP_GPE_L	(GCR_BA+0x090)  /* GPIOE Low Byte Multiple Function Control Register */
#define    REG_MFP_GPE_H	(GCR_BA+0x094)  /* GPIOE High Byte Multiple Function Control Register */
#define    REG_MFP_GPF_L	(GCR_BA+0x098)  /* GPIOF Low Byte Multiple Function Control Register */
#define    REG_MFP_GPF_H	(GCR_BA+0x09C)  /* GPIOF High Byte Multiple Function Control Register */
#define    REG_MFP_GPG_L	(GCR_BA+0x0A0)  /* GPIOG Low Byte Multiple Function Control Register */
#define    REG_MFP_GPG_H	(GCR_BA+0x0A4)  /* GPIOG High Byte Multiple Function Control Register */
#define    REG_MFP_GPH_L	(GCR_BA+0x0A8)  /* GPIOH Low Byte Multiple Function Control Register */
#define    REG_MFP_GPH_H	(GCR_BA+0x0AC)  /* GPIOH High Byte Multiple Function Control Register */
#define    REG_MFP_GPI_L	(GCR_BA+0x0B0)  /* GPIOI Low Byte Multiple Function Control Register */
#define    REG_MFP_GPI_H	(GCR_BA+0x0B4)  /* GPIOI High Byte Multiple Function Control Register */
#define    REG_MFP_GPJ_L	(GCR_BA+0x0B8)  /* GPIOJ Low Byte Multiple Function Control Register */
#define    REG_DDR_DS_CR	(GCR_BA+0x0E0)  /* DDR I/O Driving Strength Control Register */
#define    REG_PORDISCR	    (GCR_BA+0x100)  /* Power-On-Reset Disable Control Register */
#define    REG_ICEDBGCR	    (GCR_BA+0x104)  /* ICE Debug Interface Control Register */
#define    REG_ERRADDCR	    (GCR_BA+0x108)  /* Error Response Address Control Regsiter */
#define    REG_WRPRTR	    (GCR_BA+0x1FC)  /* Register Write-Protection Control Register */

