OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
#define    rREGWRPRTR			(*(unsigned int volatile *)REG_WRPRTR)

/*                                                            
  Clock Control Registers  
*/
#define    REG_PMCON			(CLK_BA+0x000)  /*  Power Management Control Register */
#define    REG_HCLKEN			(CLK_BA+0x010)  /*  AHB IP Clock Enable Control Register */
#define    REG_PCLKEN0		(CLK_BA+0x018)  /*  APB IP Clock Enable Control Register 0 */
#define    REG_PCLKEN1		(CLK_BA+0x01C)  /*  APB IP Clock Enable Control Register 1 */
#define    REG_CLKDIV0		(CLK_BA+0x020)  /*  Clock Divider Control Register 0 */
#define    REG_CLKDIV1		(CLK_BA+0x024)  /*  Clock Divider Control Register 1 */
#define    REG_CLKDIV2		(CLK_BA+0x028)  /*  Clock Divider Control Register 2 */
#define    REG_CLKDIV3		(CLK_BA+0x02C)  /*  Clock Divider Control Register 3 */
#define    REG_CLKDIV4		(CLK_BA+0x030)  /*  Clock Divider Control Register 4 */
#define    REG_CLKDIV5		(CLK_BA+0x034)  /*  Clock Divider Control Register 5 */
#define    REG_CLKDIV6		(CLK_BA+0x038)  /*  Clock Divider Control Register 6 */
#define    REG_CLKDIV7		(CLK_BA+0x03C)  /*  Clock Divider Control Register 7 */
#define    REG_CLKDIV8		(CLK_BA+0x040)  /*  Clock Divider Control Register 8 */
#define    REG_CLKDIV9		(CLK_BA+0x044)  /*  Clock Divider Control Register 9 */
#define    REG_APLLCON		(CLK_BA+0x060)  /*  APLL Control Register */
#define    REG_UPLLCON		(CLK_BA+0x064)  /*  UPLL Control Register */
#define    REG_CLKTREG		(CLK_BA+0x080)  /*  Test Clock Control Register */

#define    rCLKEN			(*(unsigned int volatile *)REG_CLKEN)
#define    rHCLKEN			(*(unsigned int volatile *)REG_HCLKEN)
#define    rPCLKEN0			(*(unsigned int volatile *)REG_PCLKEN0)
#define    rPCLKEN1			(*(unsigned int volatile *)REG_PCLKEN1)
#define    rCLKDIV			(*(unsigned int volatile *)REG_CLKDIV)
#define    rPLLCON0			(*(unsigned int volatile *)REG_PLLCON0)
#define    rPLLCON1			(*(unsigned int volatile *)REG_PLLCON1)
#define    rPMCON			(*(unsigned int volatile *)REG_PMCON)
#define    rIRQWAKECON		(*(unsigned int volatile *)REG_IRQWAKECON)
#define    rIRQWAKEFLAG		(*(unsigned int volatile *)REG_IRQWAKEFLAG)
#define    rIPSRST			(*(unsigned int volatile *)REG_IPSRST)
#define    rCLKEN1			(*(unsigned int volatile *)REG_CLKEN1)
#define    rCLKDIV1			(*(unsigned int volatile *)REG_CLKDIV1)
#define    rCLKDIV8			(*(unsigned int volatile *)REG_CLKDIV8)

/*
  EBI Control Registers  
*/
#define    REG_EBICON		(EBI_BA+0x000)  /* EBI control register */
#define    REG_ROMCON		(EBI_BA+0x004)  /* ROM/FLASH control register */
#define    REG_SDCONF0		(EBI_BA+0x008)  /* SDRAM bank 0 configuration register */
#define    REG_SDCONF1		(EBI_BA+0x00C)  /* SDRAM bank 1 configuration register */
#define    REG_SDTIME0		(EBI_BA+0x010)  /* SDRAM bank 0 timing control register */
#define    REG_SDTIME1		(EBI_BA+0x014)  /* SDRAM bank 1 timing control register */
#define    REG_EXT0CON		(EBI_BA+0x018)  /* External I/O 0 control register */
#define    REG_EXT1CON		(EBI_BA+0x01C)  /* External I/O 1 control register */
#define    REG_EXT2CON		(EBI_BA+0x020)  /* External I/O 2 control register */
#define    REG_EXT3CON		(EBI_BA+0x024)  /* External I/O 3 control register */
#define    REG_EXT4CON		(EBI_BA+0x028)  /* External I/O 4 control register */
#define    REG_CKSKEW		(EBI_BA+0x02C)  /* Clock skew control register */

#define    rEBICON			(*(unsigned int volatile *)REG_EBICON)
#define    rROMCON			(*(unsigned int volatile *)REG_ROMCON)
#define    rSDCONF0			(*(unsigned int volatile *)REG_SDCONF0)
#define    rSDCONF1			(*(unsigned int volatile *)REG_SDCONF1)
#define    rSDTIME0			(*(unsigned int volatile *)REG_SDTIME0)
#define    rSDTIME1			(*(unsigned int volatile *)REG_SDTIME1)
#define    rEXT0CON			(*(unsigned int volatile *)REG_EXT1CON)
#define    rEXT2CON			(*(unsigned int volatile *)REG_EXT2CON)
#define    rEXT3CON			(*(unsigned int volatile *)REG_EXT3CON)
#define    rEXT4CON			(*(unsigned int volatile *)REG_EXT4CON)
#define    rCKSKEW			(*(unsigned int volatile *)REG_CKSKEW)


/*
  EMAC Registers
*/
#define     REG_EMAC0_CAMCMR		(EMC0_BA+0x000)	/* CAM Command Register */
#define     REG_EMAC0_CAMEN			(EMC0_BA+0x004)	/* CAM Enable Register */
#define     REG_EMAC0_CAM0M_Base	(EMC0_BA+0x008)  /* CAM0 Most Significant Word Register */
#define     REG_EMAC0_CAM0L_Base	(EMC0_BA+0x00c)  /* CAM0 Least Significant Word Register */
#define     REG_EMAC0_CAMxM_Reg(x)	(REG_EMAC0_CAM0M_Base+x*0x8)	/* CAMx Most Significant Word Register */
#define     REG_EMAC0_CAMxL_Reg(x)	(REG_EMAC0_CAM0L_Base+x*0x8)	/* CAMx Least Significant Word Register */
#define     REG_EMAC0_TXDLSA		(EMC0_BA+0x088)	/* Transmit Descriptor Link List Start Address Register */
#define     REG_EMAC0_RXDLSA		(EMC0_BA+0x08C)	/* Receive Descriptor Link List Start Address Register */
#define     REG_EMAC0_MCMDR			(EMC0_BA+0x090)	/* MAC Command Register */
#define     REG_EMAC0_MIID			(EMC0_BA+0x094)	/* MII Management Data Register */
#define     REG_EMAC0_MIIDA			(EMC0_BA+0x098)	/* MII Management Control and Address Register */
#define     REG_EMAC0_FFTCR			(EMC0_BA+0x09C)	/* FIFO Threshold Control Register */
#define     REG_EMAC0_TSDR			(EMC0_BA+0x0a0)	/* Transmit Start Demand Register */
#define     REG_EMAC0_RSDR			(EMC0_BA+0x0a4)	/* Receive Start Demand Register */
#define     REG_EMAC0_DMARFC		(EMC0_BA+0x0a8)	/* Maximum Receive Frame Control Register */
#define     REG_EMAC0_MIEN			(EMC0_BA+0x0ac)	/* MAC Interrupt Enable Register */
#define     REG_EMAC0_MISTA			(EMC0_BA+0x0b0)	/* MAC Interrupt Status Register */
#define     REG_EMAC0_MGSTA			(EMC0_BA+0x0b4)	/* MAC General Status Register */
#define     REG_EMAC0_MPCNT			(EMC0_BA+0x0b8)	/* Missed Packet Count Register */
#define     REG_EMAC0_MRPC			(EMC0_BA+0x0bc)	/* MAC Receive Pause Count Register */
#define     REG_EMAC0_DMARFS		(EMC0_BA+0x0c8)	/* DMA Receive Frame Status Register */
#define     REG_EMAC0_CTXDSA		(EMC0_BA+0x0cc)	/* Current Transmit Descriptor Start Address Register */
#define     REG_EMAC0_CTXBSA		(EMC0_BA+0x0d0)	/* Current Transmit Buffer Start Address Register */
#define     REG_EMAC0_CRXDSA		(EMC0_BA+0x0d4)	/* Current Receive Descriptor Start Address Register */
#define     REG_EMAC0_CRXBSA		(EMC0_BA+0x0d8)	/* Current Receive Buffer Start Address Register */
#define     REG_EMAC0_TSCR			(EMC0_BA+0x100)	/* Time Stamp Control Register */
#define     REG_EMAC0_TSMSR			(EMC0_BA+0x110)	/* Time Stamp Most Significant Register  */
#define     REG_EMAC0_TSMLR			(EMC0_BA+0x114) /* Time Stamp Least Significant Register */
#define     REG_EMAC0_TSIR			(EMC0_BA+0x118)	/* Time Stamp Increment Register */
#define     REG_EMAC0_TSAR			(EMC0_BA+0x11c)	/* Time Stamp Addend Register */
#define     REG_EMAC0_TSMSUR		(EMC0_BA+0x120)	/* Time Stamp Most Significant Update Register */
#define     REG_EMAC0_TSLSUR		(EMC0_BA+0x124) /* Time Stamp Least Significant Update Register */
#define     REG_EMAC0_TSMSAR		(EMC0_BA+0x128) /* Time Stamp Most Significant Alarm Register */
#define     REG_EMAC0_TSLSAR		(EMC0_BA+0x12c)	/* Time Stamp Least Significant Alarm Register */
#define     REG_EMAC0_BIST			(EMC0_BA+0x300)	/* BIST Mode Register */
	
