OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
#define     rEMAC0_CAMCMR			(*(unsigned int volatile *)REG_EMAC0_CAMCMR)
#define     rEMAC0_CAMEN			(*(unsigned int volatile *)REG_EMAC0_CAMEN)
#define     rEMAC0_CAM0M_Base		(*(unsigned int volatile *)REG_EMAC0_CAM0M_Base)
#define     rEMAC0_CAM0L_Base		(*(unsigned int volatile *)REG_EMAC0_CAM0L_Base)
#define     rEMAC0_CAMxM_Reg(x)		(*(unsigned int volatile *)(REG_EMAC0_CAM0M_Base+x*0x8))	
#define     rEMAC0_CAMxL_Reg(x)		(*(unsigned int volatile *)(REG_EMAC0_CAM0L_Base+x*0x8))	
#define     rEMAC0_TXDLSA			(*(unsigned int volatile *)REG_EMAC0_TXDLSA)
#define     rEMAC0_RXDLSA			(*(unsigned int volatile *)REG_EMAC0_RXDLSA)
#define     rEMAC0_MCMDR			(*(unsigned int volatile *)REG_EMAC0_MCMDR)
#define     rEMAC0_MIID				(*(unsigned int volatile *)REG_EMAC0_MIID)
#define     rEMAC0_MIIDA			(*(unsigned int volatile *)REG_EMAC0_MIIDA)
#define     rEMAC0_FFTCR			(*(unsigned int volatile *)REG_EMAC0_FFTCR)
#define     rEMAC0_TSDR				(*(unsigned int volatile *)REG_EMAC0_TSDR)
#define     rEMAC0_RSDR				(*(unsigned int volatile *)REG_EMAC0_RSDR)
#define     rEMAC0_DMARFC			(*(unsigned int volatile *)REG_EMAC0_DMARFC)
#define     rEMAC0_MIEN				(*(unsigned int volatile *)REG_EMAC0_MIEN)
#define     rEMAC0_MISTA			(*(unsigned int volatile *)REG_EMAC0_MISTA)
#define     rEMAC0_MGSTA			(*(unsigned int volatile *)REG_EMAC0_MGSTA)
#define     rEMAC0_MPCNT			(*(unsigned int volatile *)REG_EMAC0_MPCNT)
#define     rEMAC0_MRPC				(*(unsigned int volatile *)REG_EMAC0_MRPC)
#define     rEMAC0_DMARFS			(*(unsigned int volatile *)REG_EMAC0_DMARFS)
#define     rEMAC0_CTXDSA			(*(unsigned int volatile *)REG_EMAC0_CTXDSA)
#define     rEMAC0_CTXBSA			(*(unsigned int volatile *)REG_EMAC0_CTXBSA)
#define     rEMAC0_CRXDSA			(*(unsigned int volatile *)REG_EMAC0_CRXDSA)
#define     rEMAC0_CRXBSA			(*(unsigned int volatile *)REG_EMAC0_CRXBSA)
#define 	rEMAC0_TSCR				(*(unsigned int volatile *)REG_EMAC0_TSCR)
#define 	rEMAC0_TSMSR			(*(unsigned int volatile *)REG_EMAC0_TSMSR)
#define 	rEMAC0_TSLSR			(*(unsigned int volatile *)REG_EMAC0_TSLSR)
#define 	rEMAC0_TSIR				(*(unsigned int volatile *)REG_EMAC0_TSIR)
#define 	rEMAC0_TSAR				(*(unsigned int volatile *)REG_EMAC0_TSAR)
#define 	rEMAC0_TSMSUR			(*(unsigned int volatile *)REG_EMAC0_TSMSUR)
#define 	rEMAC0_TSLSUR			(*(unsigned int volatile *)REG_EMAC0_TSLSUR)
#define 	rEMAC0_TSMSAR			(*(unsigned int volatile *)REG_EMAC0_TSMSAR)
#define 	rEMAC0_TSLSAR			(*(unsigned int volatile *)REG_EMAC0_TSLSAR)
#define 	rEMAC0_BIST				(*(unsigned int volatile *)REG_EMAC0_BIST)

#define     REG_EMAC1_CAMCMR		(EMC1_BA+0x000)	/* CAM Command Register */
#define     REG_EMAC1_CAMEN			(EMC1_BA+0x004)	/* CAM Enable Register */
#define     REG_EMAC1_CAM0M_Base	(EMC1_BA+0x008)  /* CAM0 Most Significant Word Register */
#define     REG_EMAC1_CAM0L_Base	(EMC1_BA+0x00c)  /* CAM0 Least Significant Word Register */
#define     REG_EMAC1_CAMxM_Reg(x)	(REG_EMAC1_CAM0M_Base+x*0x8)	/* CAMx Most Significant Word Register */
#define     REG_EMAC1_CAMxL_Reg(x)	(REG_EMAC1_CAM0L_Base+x*0x8)	/* CAMx Least Significant Word Register */
#define     REG_EMAC1_TXDLSA		(EMC1_BA+0x088)	/* Transmit Descriptor Link List Start Address Register */
#define     REG_EMAC1_RXDLSA		(EMC1_BA+0x08C)	/* Receive Descriptor Link List Start Address Register */
#define     REG_EMAC1_MCMDR			(EMC1_BA+0x090)	/* MAC Command Register */
#define     REG_EMAC1_MIID			(EMC1_BA+0x094)	/* MII Management Data Register */
#define     REG_EMAC1_MIIDA			(EMC1_BA+0x098)	/* MII Management Control and Address Register */
#define     REG_EMAC1_FFTCR			(EMC1_BA+0x09C)	/* FIFO Threshold Control Register */
#define     REG_EMAC1_TSDR			(EMC1_BA+0x0a0)	/* Transmit Start Demand Register */
#define     REG_EMAC1_RSDR			(EMC1_BA+0x0a4)	/* Receive Start Demand Register */
#define     REG_EMAC1_DMARFC		(EMC1_BA+0x0a8)	/* Maximum Receive Frame Control Register */
#define     REG_EMAC1_MIEN			(EMC1_BA+0x0ac)	/* MAC Interrupt Enable Register */
#define     REG_EMAC1_MISTA			(EMC1_BA+0x0b0)	/* MAC Interrupt Status Register */
#define     REG_EMAC1_MGSTA			(EMC1_BA+0x0b4)	/* MAC General Status Register */
#define     REG_EMAC1_MPCNT			(EMC1_BA+0x0b8)	/* Missed Packet Count Register */
#define     REG_EMAC1_MRPC			(EMC1_BA+0x0bc)	/* MAC Receive Pause Count Register */
#define     REG_EMAC1_DMARFS		(EMC1_BA+0x0c8)	/* DMA Receive Frame Status Register */
#define     REG_EMAC1_CTXDSA		(EMC1_BA+0x0cc)	/* Current Transmit Descriptor Start Address Register */
#define     REG_EMAC1_CTXBSA		(EMC1_BA+0x0d0)	/* Current Transmit Buffer Start Address Register */
#define     REG_EMAC1_CRXDSA		(EMC1_BA+0x0d4)	/* Current Receive Descriptor Start Address Register */
#define     REG_EMAC1_CRXBSA		(EMC1_BA+0x0d8)	/* Current Receive Buffer Start Address Register */
#define     REG_EMAC1_TSCR			(EMC1_BA+0x100)	/* Time Stamp Control Register */
#define     REG_EMAC1_TSMSR			(EMC1_BA+0x110)	/* Time Stamp Most Significant Register  */
#define     REG_EMAC1_TSMLR			(EMC1_BA+0x114) /* Time Stamp Least Significant Register */
#define     REG_EMAC1_TSIR			(EMC1_BA+0x118)	/* Time Stamp Increment Register */
#define     REG_EMAC1_TSAR			(EMC1_BA+0x11c)	/* Time Stamp Addend Register */
#define     REG_EMAC1_TSMSUR		(EMC1_BA+0x120)	/* Time Stamp Most Significant Update Register */
#define     REG_EMAC1_TSLSUR		(EMC1_BA+0x124) /* Time Stamp Least Significant Update Register */
#define     REG_EMAC1_TSMSAR		(EMC1_BA+0x128) /* Time Stamp Most Significant Alarm Register */
#define     REG_EMAC1_TSLSAR		(EMC1_BA+0x12c)	/* Time Stamp Least Significant Alarm Register */
#define     REG_EMAC1_BIST			(EMC1_BA+0x300)	/* BIST Mode Register */
	
#define     rEMAC1_CAMCMR			(*(unsigned int volatile *)REG_EMAC1_CAMCMR)
#define     rEMAC1_CAMEN			(*(unsigned int volatile *)REG_EMAC1_CAMEN)
#define     rEMAC1_CAM0M_Base		(*(unsigned int volatile *)REG_EMAC1_CAM0M_Base)
#define     rEMAC1_CAM0L_Base		(*(unsigned int volatile *)REG_EMAC1_CAM0L_Base)
#define     rEMAC1_CAMxM_Reg(x)		(*(unsigned int volatile *)(REG_EMAC1_CAM0M_Base+x*0x8))	
#define     rEMAC1_CAMxL_Reg(x)		(*(unsigned int volatile *)(REG_EMAC1_CAM0L_Base+x*0x8))	
#define     rEMAC1_TXDLSA			(*(unsigned int volatile *)REG_EMAC1_TXDLSA)
#define     rEMAC1_RXDLSA			(*(unsigned int volatile *)REG_EMAC1_RXDLSA)
#define     rEMAC1_MCMDR			(*(unsigned int volatile *)REG_EMAC1_MCMDR)
#define     rEMAC1_MIID				(*(unsigned int volatile *)REG_EMAC1_MIID)
#define     rEMAC1_MIIDA			(*(unsigned int volatile *)REG_EMAC1_MIIDA)
#define     rEMAC1_FFTCR			(*(unsigned int volatile *)REG_EMAC1_FFTCR)
#define     rEMAC1_TSDR				(*(unsigned int volatile *)REG_EMAC1_TSDR)
#define     rEMAC1_RSDR				(*(unsigned int volatile *)REG_EMAC1_RSDR)
#define     rEMAC1_DMARFC			(*(unsigned int volatile *)REG_EMAC1_DMARFC)
#define     rEMAC1_MIEN				(*(unsigned int volatile *)REG_EMAC1_MIEN)
#define     rEMAC1_MISTA			(*(unsigned int volatile *)REG_EMAC1_MISTA)
#define     rEMAC1_MGSTA			(*(unsigned int volatile *)REG_EMAC1_MGSTA)
#define     rEMAC1_MPCNT			(*(unsigned int volatile *)REG_EMAC1_MPCNT)
#define     rEMAC1_MRPC				(*(unsigned int volatile *)REG_EMAC1_MRPC)
#define     rEMAC1_DMARFS			(*(unsigned int volatile *)REG_EMAC1_DMARFS)
#define     rEMAC1_CTXDSA			(*(unsigned int volatile *)REG_EMAC1_CTXDSA)
#define     rEMAC1_CTXBSA			(*(unsigned int volatile *)REG_EMAC1_CTXBSA)
#define     rEMAC1_CRXDSA			(*(unsigned int volatile *)REG_EMAC1_CRXDSA)
#define     rEMAC1_CRXBSA			(*(unsigned int volatile *)REG_EMAC1_CRXBSA)
#define 	rEMAC1_TSCR				(*(unsigned int volatile *)REG_EMAC1_TSCR)
#define 	rEMAC1_TSMSR			(*(unsigned int volatile *)REG_EMAC1_TSMSR)
#define 	rEMAC1_TSLSR			(*(unsigned int volatile *)REG_EMAC1_TSLSR)
#define 	rEMAC1_TSIR				(*(unsigned int volatile *)REG_EMAC1_TSIR)
#define 	rEMAC1_TSAR				(*(unsigned int volatile *)REG_EMAC1_TSAR)
#define 	rEMAC1_TSMSUR			(*(unsigned int volatile *)REG_EMAC1_TSMSUR)
#define 	rEMAC1_TSLSUR			(*(unsigned int volatile *)REG_EMAC1_TSLSUR)
#define 	rEMAC1_TSMSAR			(*(unsigned int volatile *)REG_EMAC1_TSMSAR)
#define 	rEMAC1_TSLSAR			(*(unsigned int volatile *)REG_EMAC1_TSLSAR)
#define 	rEMAC1_BIST				(*(unsigned int volatile *)REG_EMAC1_BIST)


