OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  GDMA Registers
*/
#define     REG_GDMA_CTL0	(GDMA_BA+0x000)  /* Channel 0 Control Register */
#define     REG_GDMA_SRCB0	(GDMA_BA+0x004)  /* Channel 0 Source Base Address Register */
#define     REG_GDMA_DSTB0	(GDMA_BA+0x008)  /* Channel 0 Destination Base Address Register */
#define     REG_GDMA_TCNT0	(GDMA_BA+0x00C)  /* Channel 0 Transfer Count Register */
#define     REG_GDMA_CSRC0	(GDMA_BA+0x010)  /* Channel 0 Current Source Address Register */
#define     REG_GDMA_CDST0	(GDMA_BA+0x014)  /* Channel 0 Current Destination Address Register */
#define     REG_GDMA_CTCNT0	(GDMA_BA+0x018)  /* Channel 0 Current Transfer Count Register */
#define     REG_GDMA_DADR0	(GDMA_BA+0x01C)  /* Channel 0 Descriptor Address Register */
#define     REG_GDMA_CTL1	(GDMA_BA+0x020)  /* Channel 1 Control Register */
#define     REG_GDMA_SRCB1	(GDMA_BA+0x024)  /* Channel 1 Source Base Address Register */
#define     REG_GDMA_DSTB1	(GDMA_BA+0x028)  /* Channel 1 Destination Base Address Register */
#define     REG_GDMA_TCNT1	(GDMA_BA+0x02C)  /* Channel 1 Transfer Count Register */
#define     REG_GDMA_CSRC1	(GDMA_BA+0x030)  /* Channel 1 Current Source Address Register */
#define     REG_GDMA_CDST1	(GDMA_BA+0x034)  /* Channel 1 Current Destination Address Register */
#define     REG_GDMA_CTCNT1	(GDMA_BA+0x038)  /* Channel 1 Current Transfer Count Register */
#define     REG_GDMA_DADR1	(GDMA_BA+0x03C)  /* Channel 1 Descriptor Address Register */
#define     REG_GDMA_INTBUF0    (GDMA_BA+0x080)  /* GDMA Internal Buffer Word 0 */
#define     REG_GDMA_INTBUF1    (GDMA_BA+0x084)  /* GDMA Internal Buffer Word 1 */
#define     REG_GDMA_INTBUF2    (GDMA_BA+0x088)  /* GDMA Internal Buffer Word 2 */
#define     REG_GDMA_INTBUF3    (GDMA_BA+0x08C)  /* GDMA Internal Buffer Word 3 */
#define     REG_GDMA_INTBUF4    (GDMA_BA+0x090)  /* GDMA Internal Buffer Word 4 */
#define     REG_GDMA_INTBUF5    (GDMA_BA+0x094)  /* GDMA Internal Buffer Word 5 */
#define     REG_GDMA_INTBUF6    (GDMA_BA+0x098)  /* GDMA Internal Buffer Word 6 */
#define     REG_GDMA_INTBUF7    (GDMA_BA+0x09C)  /* GDMA Internal Buffer Word 7 */
#define     REG_GDMA_INTCS	(GDMA_BA+0x0A0)  /* Interrupt Control and Status Register */

#define     rCTL0			(*(unsigned int volatile *)REG_GDMA_CTL0)
#define     rSRCB0			(*(unsigned int volatile *)REG_GDMA_SRCB0)
#define     rDSTB0			(*(unsigned int volatile *)REG_GDMA_DSTB0)
#define     rTCNT0			(*(unsigned int volatile *)REG_GDMA_TCNT0)
#define     rCSRC0			(*(unsigned int volatile *)REG_GDMA_CSRC0)
#define     rCDST0			(*(unsigned int volatile *)REG_GDMA_CDST0)
#define     rCTCNT0			(*(unsigned int volatile *)REG_GDMA_CTCNT0)
#define     rDADR0			(*(unsigned int volatile *)REG_GDMA_DADR0)
#define     rCTL1			(*(unsigned int volatile *)REG_GDMA_CTL1)
#define     rSRCB1			(*(unsigned int volatile *)REG_GDMA_SRCB1)
#define     rDSTB1			(*(unsigned int volatile *)REG_GDMA_DSTB1)
#define     rTCNT1			(*(unsigned int volatile *)REG_GDMA_TCNT1)
#define     rCSRC1			(*(unsigned int volatile *)REG_GDMA_CSRC1)
#define     rCDST1			(*(unsigned int volatile *)REG_GDMA_CDST1)
#define     rCTCNT1			(*(unsigned int volatile *)REG_GDMA_CTCNT1)
#define     rDADR1			(*(unsigned int volatile *)REG_GDMA_DADR1)
#define     rINTBUF0    	(*(unsigned int volatile *)REG_GDMA_INTBUF0)   
#define     rINTBUF1    	(*(unsigned int volatile *)REG_GDMA_INTBUF1)
#define     rINTBUF2   		(*(unsigned int volatile *)REG_GDMA_INTBUF2)
#define     rINTBUF3    	(*(unsigned int volatile *)REG_GDMA_INTBUF3)
#define     rINTBUF4    	(*(unsigned int volatile *)REG_GDMA_INTBUF4)
#define     rINTBUF5    	(*(unsigned int volatile *)REG_GDMA_INTBUF5)
#define     rINTBUF6   		(*(unsigned int volatile *)REG_GDMA_INTBUF6)
#define     rINTBUF7    	(*(unsigned int volatile *)REG_GDMA_INTBUF7)
#define     rINTCS			(*(unsigned int volatile *)REG_GDMA_INTCS)


/*
  USBH Registers
*/
#define     REG_EHCVNR		(USBH_BA+0x000)  /* EHCI Version Number Register */
#define     REG_EHCSPR		(USBH_BA+0x004)  /* EHCI Structural Parameters Register */
#define     REG_EHCCPR		(USBH_BA+0x008)  /* EHCI Capability Parameters Register */
#define     REG_UCMDR		(USBH_BA+0x020)  /* USB Command Register */
#define     REG_USTSR		(USBH_BA+0x024)  /* USB Status Register */
#define     REG_UIENR		(USBH_BA+0x028)  /* USB Interrupt Enable Register */
#define     REG_UFINDR		(USBH_BA+0x02C)  /* USB Frame Index Register */
#define     REG_UPFLBAR		(USBH_BA+0x034)  /* USB Periodic Frame List Base Address Register */
#define     REG_UCALAR		(USBH_BA+0x038)  /* USB Current Asynchronous List Address Register */
#define     REG_UASSTR		(USBH_BA+0x03C)  /* USB Asynchronous Schedule Sleep Timer Register */
#define     REG_UCFGR		(USBH_BA+0x060)  /* USB Configure Flag Register */
#define     REG_UPSCR0		(USBH_BA+0x064)  /* USB Port 0 Status and Control Register */
#define     REG_UPSCR1		(USBH_BA+0x068)  /* USB Port 1 Status and Control Register */
#define     REG_USBPCR0		(USBH_BA+0x0C4)  /* USB PHY 0 Control Register */
#define     REG_USBPCR1		(USBH_BA+0x0C8)  /* USB PHY 1 Control Register */

#define     rEHCVNR			(*(unsigned int volatile *)REG_EHCVNR)
#define     rEHCSPR			(*(unsigned int volatile *)REG_EHCSPR)
#define     rEHCCPR			(*(unsigned int volatile *)REG_EHCCPR)
#define     rUCMDR			(*(unsigned int volatile *)REG_UCMDR)
#define     rUSTSR			(*(unsigned int volatile *)REG_USTSR)
#define     rUIENR			(*(unsigned int volatile *)REG_UIENR)
#define     rUFINDR			(*(unsigned int volatile *)REG_UFINDR)
#define     rUPFLBAR		(*(unsigned int volatile *)REG_UPFLBAR)
#define     rUCALAR			(*(unsigned int volatile *)REG_UCALAR)
#define     rUASSTR			(*(unsigned int volatile *)REG_UASSTR)
#define     rUCFGR			(*(unsigned int volatile *)REG_UCFGR)
#define     rUPSCR0			(*(unsigned int volatile *)REG_UPSCR0)
#define     rUPSCR1			(*(unsigned int volatile *)REG_UPSCR1)
#define     rUSBPCR0		(*(unsigned int volatile *)REG_USBPCR0)
#define     rUSBPCR1		(*(unsigned int volatile *)REG_USBPCR1)


