OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
USBH OHCI Registers
*/
#define     REG_HcRev		(USBO_BA+0x000)  /* Host Controller Revision Register */
#define     REG_HcControl	(USBO_BA+0x004)  /* Host Controller Control Register */
#define     REG_HcComSts	(USBO_BA+0x008)  /* Host Controller Command Status Register */
#define     REG_HcIntSts	(USBO_BA+0x00C)  /* Host Controller Interrupt Status Register */
#define     REG_HcIntEn		(USBO_BA+0x010)  /* Host Controller Interrupt Enable Register */
#define     REG_HcIntDis	(USBO_BA+0x014)  /* Host Controller Interrupt Disable Register */
#define     REG_HcHCCA		(USBO_BA+0x018)  /* Host Controller Communication Area Register */
#define     REG_HcPerCED	(USBO_BA+0x01C)  /* Host Controller Period Current ED Register */
#define     REG_HcCtrHED	(USBO_BA+0x020)  /* Host Controller Control Head ED Registerr */
#define     REG_HcCtrCED	(USBO_BA+0x024)  /* Host Controller Control Current ED Register */
#define     REG_HcBlkHED	(USBO_BA+0x028)  /* Host Controller Bulk Head ED Register */
#define     REG_HcBlkCED	(USBO_BA+0x02C)	 /* Host Controller Bulk Current ED Register */
#define     REG_HcDoneH		(USBO_BA+0x030)	 /* Host Controller Done Head Register */
#define     REG_HcFmIntv	(USBO_BA+0x034)	 /* Host Controller Frame Interval Register */
#define     REG_HcFmRem		(USBO_BA+0x038)	 /* Host Controller Frame Remaining Register */
#define     REG_HcFNum		(USBO_BA+0x03C)	 /* Host Controller Frame Number Register */
#define     REG_HcPerSt		(USBO_BA+0x040)	 /* Host Controller Periodic Start Register */
#define     REG_HcLSTH		(USBO_BA+0x044)	 /* Host Controller Low Speed Threshold Register */
#define     REG_HcRhDeA		(USBO_BA+0x048)	 /* Host Controller Root Hub Descriptor A Register */
#define     REG_HcRhDeB		(USBO_BA+0x04C)	 /* Host Controller Root Hub Descriptor B Register */
#define     REG_HcRhSts		(USBO_BA+0x050)	 /* Host Controller Root Hub Status Register */
#define     REG_HcRhPrt1	(USBO_BA+0x054)	 /* Host Controller Root Hub Port Status [1] */
#define     REG_HcRhPrt2	(USBO_BA+0x058)	 /* Host Controller Root Hub Port Status [2] */
#define     REG_OpModEn		(USBO_BA+0x204)	 /* USB Operational Mode Enable Register */

#define     rHcRev			(*(unsigned int volatile *)REG_HcRev)
#define     rHcControl		(*(unsigned int volatile *)REG_HcControl)
#define     rHcComSts		(*(unsigned int volatile *)REG_HcComSts)
#define     rHcIntSts		(*(unsigned int volatile *)REG_HcIntSts)
#define     rHcIntEn		(*(unsigned int volatile *)REG_HcIntEn)
#define     rHcIntDis		(*(unsigned int volatile *)REG_HcIntDis)
#define     rHcHCCA			(*(unsigned int volatile *)REG_HcHCCA)
#define     rHcPerCED		(*(unsigned int volatile *)REG_HcPerCED)
#define     rHcCtrHED		(*(unsigned int volatile *)REG_HcCtrHED)
#define     rHcCtrCED		(*(unsigned int volatile *)REG_HcCtrCED)
#define     rHcBlkHED		(*(unsigned int volatile *)REG_HcBlkHED)
#define     rHcBlkCED		(*(unsigned int volatile *)REG_HcBlkCED)
#define     rHcDoneH		(*(unsigned int volatile *)REG_HcDoneH)
#define     rHcFmIntv		(*(unsigned int volatile *)REG_HcFmIntv)
#define     rHcFmRem		(*(unsigned int volatile *)REG_HcFmRem)
#define     rHcFNum			(*(unsigned int volatile *)REG_HcFNum)
#define     rHcPerSt		(*(unsigned int volatile *)REG_HcPerSt)
#define     rHcLSTH			(*(unsigned int volatile *)REG_HcLSTH)
#define     rHcRhDeA		(*(unsigned int volatile *)REG_HcRhDeA)
#define     rHcRhDeB		(*(unsigned int volatile *)REG_HcRhDeB)
#define     rHcRhSts		(*(unsigned int volatile *)REG_HcRhSts)
#define     rHcRhPrt1		(*(unsigned int volatile *)REG_HcRhPrt1)
#define     rHcRhPrt2		(*(unsigned int volatile *)REG_HcRhPrt2)
#define     rOpModEn		(*(unsigned int volatile *)REG_OpModEn)


/*
USB Device Control Registers  
*/
#define     REG_USBD_IRQ_STAT_L		(USBD_BA+0x00)  /* interrupt status register */
#define     REG_USBD_IRQ_ENB_L		(USBD_BA+0x08)  /* interrupt enable low register */
#define     REG_USBD_IRQ_STAT		(USBD_BA+0x10)  /* usb interrupt status register */
#define     REG_USBD_IRQ_ENB		(USBD_BA+0x14)  /* usb interrupt enable register */
#define     REG_USBD_OPER			(USBD_BA+0x18)  /* usb operation register */
#define     REG_USBD_FRAME_CNT		(USBD_BA+0x1C)	/* usb frame count register */
#define     REG_USBD_ADDR			(USBD_BA+0x20)  /* usb address register */
#define 		REG_USBD_TEST			(USBD_BA+0x024) /* usb Test Mode Register */
#define     REG_USBD_CEP_DATA_BUF	(USBD_BA+0x28)  /* control-ep data buffer register */
#define     REG_USBD_CEP_CTRL_STAT	(USBD_BA+0x2C)  /* control-ep control and status register */
#define     REG_USBD_CEP_IRQ_ENB	(USBD_BA+0x30)  /* control-ep interrupt enable register */
#define     REG_USBD_CEP_IRQ_STAT	(USBD_BA+0x34)  /* control-ep interrupt status register */
#define     REG_USBD_IN_TRNSFR_CNT	(USBD_BA+0x38)  /* in-transfer data count register */
#define     REG_USBD_OUT_TRNSFR_CNT	(USBD_BA+0x3C)  /* out-transfer data count register */
#define     REG_USBD_CEP_CNT		(USBD_BA+0x40)  /* control-ep data count register */
#define     REG_USBD_SETUP1_0		(USBD_BA+0x44)  /* setup byte1 & byte0 register */
#define     REG_USBD_SETUP3_2		(USBD_BA+0x48)  /* setup byte3 & byte2 register */
#define     REG_USBD_SETUP5_4		(USBD_BA+0x4C)  /* setup byte5 & byte4 register */
#define     REG_USBD_SETUP7_6		(USBD_BA+0x50)  /* setup byte7 & byte6 register */
#define     REG_USBD_CEP_START_ADDR	(USBD_BA+0x54)  /* control-ep ram start address register */
#define     REG_USBD_CEP_END_ADDR	(USBD_BA+0x58)  /* control-ep ram end address register */
#define     REG_USBD_DMA_CTRL_STS	(USBD_BA+0x5C)  /* dma control and status register */
#define     REG_USBD_DMA_CNT		(USBD_BA+0x60)  /* dma count register */
#define     REG_USBD_EPA_DATA_BUF	(USBD_BA+0x64)  /* endpoint A data buffer register */
#define     REG_USBD_EPA_IRQ_STAT	(USBD_BA+0x68)  /* endpoint A interrupt status register */
#define     REG_USBD_EPA_IRQ_ENB	(USBD_BA+0x6C)  /* endpoint A interrupt enable register */
#define     REG_USBD_EPA_DATA_CNT	(USBD_BA+0x70)  /* data count available in endpoint A buffer */
#define     REG_USBD_EPA_RSP_SC		(USBD_BA+0x74)  /* endpoint A response register set/clear */
#define     REG_USBD_EPA_MPS		(USBD_BA+0x78)  /* endpoint A max packet size register */
#define     REG_USBD_EPA_CNT		(USBD_BA+0x7C)  /* endpoint A transfer count register */
#define     REG_USBD_EPA_CFG		(USBD_BA+0x80)  /* endpoint A configuration register */
#define     REG_USBD_EPA_START_ADDR	(USBD_BA+0x84)  /* endpoint A ram start address register */
#define     REG_USBD_EPA_END_ADDR	(USBD_BA+0x88)  /* endpoint A ram end address register */
#define     REG_USBD_EPB_DATA_BUF	(USBD_BA+0x8C)  /* endpoint B data buffer register */
#define     REG_USBD_EPB_IRQ_STAT	(USBD_BA+0x90)  /* endpoint B interrupt status register */
#define     REG_USBD_EPB_IRQ_ENB	(USBD_BA+0x94)  /* endpoint B interrupt enable register */
#define     REG_USBD_EPB_DATA_CNT	(USBD_BA+0x98)  /* data count available in endpoint B buffer */
#define     REG_USBD_EPB_RSP_SC		(USBD_BA+0x9C)  /* endpoint B response register set/clear */
#define     REG_USBD_EPB_MPS		(USBD_BA+0xA0)  /* endpoint B max packet size register */
#define     REG_USBD_EPB_CNT		(USBD_BA+0xA4)  /* endpoint B transfer count register */
#define     REG_USBD_EPB_CFG		(USBD_BA+0xA8)  /* endpoint B configuration register */
#define     REG_USBD_EPB_START_ADDR	(USBD_BA+0xAC)  /* endpoint B ram start address register */
#define     REG_USBD_EPB_END_ADDR	(USBD_BA+0xB0)  /* endpoint B ram end address register */
#define     REG_USBD_EPC_DATA_BUF	(USBD_BA+0xB4)  /* endpoint C data buffer register */
#define     REG_USBD_EPC_IRQ_STAT	(USBD_BA+0xB8)  /* endpoint C interrupt status register */
#define     REG_USBD_EPC_IRQ_ENB	(USBD_BA+0xBC)  /* endpoint C interrupt enable register */
#define     REG_USBD_EPC_DATA_CNT	(USBD_BA+0xC0)  /* data count available in endpoint C buffer */
#define     REG_USBD_EPC_RSP_SC		(USBD_BA+0xC4)  /* endpoint C response register set/clear */
#define     REG_USBD_EPC_MPS		(USBD_BA+0xC8)  /* endpoint C max packet size register */
#define     REG_USBD_EPC_CNT		(USBD_BA+0xCC)  /* endpoint C transfer count register */
#define     REG_USBD_EPC_CFG		(USBD_BA+0xD0)  /* endpoint C configuration register */
#define     REG_USBD_EPC_START_ADDR	(USBD_BA+0xD4)  /* endpoint C ram start address register */
#define     REG_USBD_EPC_END_ADDR	(USBD_BA+0xD8)  /* endpoint C ram end address register */
#define     REG_USBD_EPD_DATA_BUF	(USBD_BA+0xDC)  /* endpoint D data buffer register */
#define     REG_USBD_EPD_IRQ_STAT	(USBD_BA+0xE0)  /* endpoint D interrupt status register */
#define     REG_USBD_EPD_IRQ_ENB	(USBD_BA+0xE4)  /* endpoint D interrupt enable register */
#define     REG_USBD_EPD_DATA_CNT	(USBD_BA+0xE8)  /* data count available in endpoint D buffer */
#define     REG_USBD_EPD_RSP_SC		(USBD_BA+0xEC)  /* endpoint D response register set/clear */
#define     REG_USBD_EPD_MPS		(USBD_BA+0xF0)  /* endpoint D max packet size register */
#define     REG_USBD_EPD_CNT		(USBD_BA+0xF4)  /* endpoint D transfer count register */
#define     REG_USBD_EPD_CFG		(USBD_BA+0xF8)  /* endpoint D configuration register */
#define     REG_USBD_EPD_START_ADDR	(USBD_BA+0xFC)  /* endpoint D ram start address register */
#define     REG_USBD_EPD_END_ADDR	(USBD_BA+0x100) /* endpoint D ram end address register */
#define     REG_USBD_EPE_DATA_BUF	(USBD_BA+0x104) /* endpoint E data buffer register */
#define     REG_USBD_EPE_IRQ_STAT	(USBD_BA+0x108) /* endpoint E interrupt status register */
#define     REG_USBD_EPE_IRQ_ENB	(USBD_BA+0x10C)	/* endpoint E interrupt enable register */
#define     REG_USBD_EPE_DATA_CNT	(USBD_BA+0x110) /* data count available in endpoint E buffer */
#define     REG_USBD_EPE_RSP_SC		(USBD_BA+0x114) /* endpoint E response register set/clear */
#define     REG_USBD_EPE_MPS		(USBD_BA+0x118) /* endpoint E max packet size register */
#define     REG_USBD_EPE_CNT		(USBD_BA+0x11C) /* endpoint E transfer count register */
#define     REG_USBD_EPE_CFG		(USBD_BA+0x120) /* endpoint E configuration register */
#define     REG_USBD_EPE_START_ADDR	(USBD_BA+0x124) /* endpoint E ram start address register */
#define     REG_USBD_EPE_END_ADDR	(USBD_BA+0x128) /* endpoint E ram end address register */
#define     REG_USBD_EPF_DATA_BUF	(USBD_BA+0x12C) /* endpoint F data buffer register */
#define     REG_USBD_EPF_IRQ_STAT	(USBD_BA+0x130) /* endpoint F interrupt status register */
#define     REG_USBD_EPF_IRQ_ENB	(USBD_BA+0x134) /* endpoint F interrupt enable register */
#define     REG_USBD_EPF_DATA_CNT	(USBD_BA+0x138) /* data count available in endpoint F buffer */
#define     REG_USBD_EPF_RSP_SC		(USBD_BA+0x13C)	/* endpoint F response register set/clear */
#define     REG_USBD_EPF_MPS		(USBD_BA+0x140) /* endpoint F max packet size register */
#define     REG_USBD_EPF_CNT		(USBD_BA+0x144) /* endpoint F transfer count register */
#define     REG_USBD_EPF_CFG		(USBD_BA+0x148) /* endpoint F configuration register */
#define     REG_USBD_EPF_START_ADDR	(USBD_BA+0x14C) /* endpoint F ram start address register */
#define     REG_USBD_EPF_END_ADDR	(USBD_BA+0x150) /* endpoint F ram end address register */
#define     REG_USBD_EPG_DATA_BUF	(USBD_BA+0x154) /* endpoint G data buffer register */
#define     REG_USBD_EPG_IRQ_STAT	(USBD_BA+0x158) /* endpoint G interrupt status register */
#define     REG_USBD_EPG_IRQ_ENB	(USBD_BA+0x15C)	/* endpoint G interrupt enable register */
#define     REG_USBD_EPG_DATA_CNT	(USBD_BA+0x160) /* data count available in endpoint G buffer */
#define     REG_USBD_EPG_RSP_SC		(USBD_BA+0x164) /* endpoint G response register set/clear */
#define     REG_USBD_EPG_MPS		(USBD_BA+0x168) /* endpoint G max packet size register */
#define     REG_USBD_EPG_CNT		(USBD_BA+0x16C) /* endpoint G transfer count register */
#define     REG_USBD_EPG_CFG		(USBD_BA+0x170) /* endpoint G configuration register */
#define     REG_USBD_EPG_START_ADDR	(USBD_BA+0x174) /* endpoint G ram start address register */
#define     REG_USBD_EPG_END_ADDR	(USBD_BA+0x178) /* endpoint G ram end address register */
#define     REG_USBD_EPH_DATA_BUF	(USBD_BA+0x17C) /* endpoint H data buffer register */
#define     REG_USBD_EPH_IRQ_STAT	(USBD_BA+0x180) /* endpoint H interrupt status register */
#define     REG_USBD_EPH_IRQ_ENB	(USBD_BA+0x184) /* endpoint H interrupt enable register */
#define     REG_USBD_EPH_DATA_CNT	(USBD_BA+0x188) /* data count available in endpoint H buffer */
#define     REG_USBD_EPH_RSP_SC		(USBD_BA+0x18C)	/* endpoint H response register set/clear */
#define     REG_USBD_EPH_MPS		(USBD_BA+0x190) /* endpoint H max packet size register */
#define     REG_USBD_EPH_CNT		(USBD_BA+0x194) /* endpoint H transfer count register */
#define     REG_USBD_EPH_CFG		(USBD_BA+0x198) /* endpoint H configuration register */
#define     REG_USBD_EPH_START_ADDR	(USBD_BA+0x19C) /* endpoint H ram start address register */
#define     REG_USBD_EPH_END_ADDR	(USBD_BA+0x1A0) /* endpoint H ram end address register */
#define     REG_USBD_EPI_DATA_BUF	(USBD_BA+0x1A4) /* endpoint I data buffer register */
#define     REG_USBD_EPI_IRQ_STAT	(USBD_BA+0x1A8) /* endpoint I interrupt status register */
#define     REG_USBD_EPI_IRQ_ENB	(USBD_BA+0x1AC)	/* endpoint I interrupt enable register */
#define     REG_USBD_EPI_DATA_CNT	(USBD_BA+0x1B0) /* data count available in endpoint I buffer */
#define     REG_USBD_EPI_RSP_SC		(USBD_BA+0x1B4) /* endpoint I response register set/clear */
#define     REG_USBD_EPI_MPS		(USBD_BA+0x1B8) /* endpoint I max packet size register */
#define     REG_USBD_EPI_CNT		(USBD_BA+0x1BC) /* endpoint I transfer count register */
#define     REG_USBD_EPI_CFG		(USBD_BA+0x1C0) /* endpoint I configuration register */
#define     REG_USBD_EPI_START_ADDR	(USBD_BA+0x1C4) /* endpoint I ram start address register */
#define     REG_USBD_EPI_END_ADDR	(USBD_BA+0x1C8) /* endpoint I ram end address register */
#define     REG_USBD_EPJ_DATA_BUF	(USBD_BA+0x1CC) /* endpoint J data buffer register */
#define     REG_USBD_EPJ_IRQ_STAT	(USBD_BA+0x1D0) /* endpoint J interrupt status register */
#define     REG_USBD_EPJ_IRQ_ENB	(USBD_BA+0x1D4) /* endpoint J interrupt enable register */
#define     REG_USBD_EPJ_DATA_CNT	(USBD_BA+0x1D8) /* data count available in endpoint J buffer */
#define     REG_USBD_EPJ_RSP_SC		(USBD_BA+0x1DC)	/* endpoint J response register set/clear */
#define     REG_USBD_EPJ_MPS		(USBD_BA+0x1E0) /* endpoint J max packet size register */
#define     REG_USBD_EPJ_CNT		(USBD_BA+0x1E4) /* endpoint J transfer count register */
#define     REG_USBD_EPJ_CFG		(USBD_BA+0x1E8) /* endpoint J configuration register */
#define     REG_USBD_EPJ_START_ADDR	(USBD_BA+0x1EC) /* endpoint J ram start address register */
#define     REG_USBD_EPJ_END_ADDR	(USBD_BA+0x1F0) /* endpoint J ram end address register */
#define     REG_USBD_EPK_DATA_BUF	(USBD_BA+0x1F4) /* endpoint K data buffer register */
#define     REG_USBD_EPK_IRQ_STAT	(USBD_BA+0x1F8) /* endpoint K interrupt status register */
#define     REG_USBD_EPK_IRQ_ENB	(USBD_BA+0x1FC)	/* endpoint K interrupt enable register */
#define     REG_USBD_EPK_DATA_CNT	(USBD_BA+0x200) /* data count available in endpoint K buffer */
#define     REG_USBD_EPK_RSP_SC		(USBD_BA+0x204) /* endpoint K response register set/clear */
#define     REG_USBD_EPK_MPS		(USBD_BA+0x208) /* endpoint K max packet size register */
#define     REG_USBD_EPK_CNT		(USBD_BA+0x20C) /* endpoint K transfer count register */
#define     REG_USBD_EPK_CFG		(USBD_BA+0x210) /* endpoint K configuration register */
#define     REG_USBD_EPK_START_ADDR	(USBD_BA+0x214) /* endpoint K ram start address register */
#define     REG_USBD_EPK_END_ADDR	(USBD_BA+0x218) /* endpoint K ram end address register */
#define     REG_USBD_EPL_DATA_BUF	(USBD_BA+0x21C) /* endpoint L data buffer register */
#define     REG_USBD_EPL_IRQ_STAT	(USBD_BA+0x220) /* endpoint L interrupt status register */
#define     REG_USBD_EPL_IRQ_ENB	(USBD_BA+0x224) /* endpoint L interrupt enable register */
#define     REG_USBD_EPL_DATA_CNT	(USBD_BA+0x228) /* data count available in endpoint L buffer */
#define     REG_USBD_EPL_RSP_SC		(USBD_BA+0x22C)	/* endpoint L response register set/clear */
#define     REG_USBD_EPL_MPS		(USBD_BA+0x230) /* endpoint L max packet size register */
#define     REG_USBD_EPL_CNT		(USBD_BA+0x234) /* endpoint L transfer count register */
#define     REG_USBD_EPL_CFG		(USBD_BA+0x238) /* endpoint L configuration register */
#define     REG_USBD_EPL_START_ADDR	(USBD_BA+0x23C) /* endpoint L ram start address register */
#define     REG_USBD_EPL_END_ADDR	(USBD_BA+0x240) /* endpoint L ram end address register */
#define     REG_USBD_AHB_DMA_ADDR	(USBD_BA+0x700) /* AHB_DMA address register */
#define     REG_USBD_PHY_CTL		(USBD_BA+0x704) /* USB PHY control register */


