OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
#define     rIRQ_STAT_L		(*(unsigned int volatile *)REG_USBD_IRQ_STAT_L)
#define     rIRQ_ENB_L		(*(unsigned int volatile *)REG_USBD_IRQ_ENB_L)
#define     rIRQ_STAT		(*(unsigned int volatile *)REG_USBD_IRQ_STAT)
#define     rIRQ_ENB		(*(unsigned int volatile *)REG_USBD_IRQ_ENB)
#define     rOPER			(*(unsigned int volatile *)REG_USBD_OPER)
#define     rFRAME_CNT		(*(unsigned int volatile *)REG_USBD_FRAME_CNT)
#define     rADDR			(*(unsigned int volatile *)REG_USBD_ADDR)
#define     rCEP_DATA_BUF	(*(unsigned int volatile *)REG_USBD_CEP_DATA_BUF)
#define     rCEP_CTRL_STAT	(*(unsigned int volatile *)REG_USBD_CEP_CTRL_STAT)
#define     rCEP_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_CEP_IRQ_ENB)
#define     rCEP_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_CEP_IRQ_STAT)
#define     rIN_TRNSFR_CNT	(*(unsigned int volatile *)REG_USBD_IN_TRNSFR_CNT)
#define     rOUT_TRNSFR_CNT	(*(unsigned int volatile *)REG_USBD_OUT_TRNSFR_CNT)
#define     rCEP_CNT		(*(unsigned int volatile *)REG_USBD_CEP_CNT)
#define     rSETUP1_0		(*(unsigned int volatile *)REG_USBD_SETUP1_0)
#define     rSETUP3_2		(*(unsigned int volatile *)REG_USBD_SETUP3_2)
#define     rSETUP5_4		(*(unsigned int volatile *)REG_USBD_SETUP5_4)
#define     rSETUP7_6		(*(unsigned int volatile *)REG_USBD_SETUP7_6)
#define     rCEP_START_ADDR	(*(unsigned int volatile *)REG_USBD_CEP_START_ADDR)
#define     rCEP_END_ADDR	(*(unsigned int volatile *)REG_USBD_CEP_END_ADDR)
#define     rDMA_CTRL_STS	(*(unsigned int volatile *)REG_USBD_DMA_CTRL_STS)
#define     rDMA_CNT		(*(unsigned int volatile *)REG_USBD_DMA_CNT)
#define     rEPA_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPA_DATA_BUF)
#define     rEPA_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPA_IRQ_STAT)
#define     rEPA_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPA_IRQ_ENB)
#define     rEPA_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPA_DATA_CNT)
#define     rEPA_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPA_RSP_SC)
#define     rEPA_MPS		(*(unsigned int volatile *)REG_USBD_EPA_MPS)
#define     rEPA_CNT		(*(unsigned int volatile *)REG_USBD_EPA_CNT)
#define     rEPA_CFG		(*(unsigned int volatile *)REG_USBD_EPA_CFG)
#define     rEPA_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPA_START_ADDR)
#define     rEPA_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPA_END_ADDR)
#define     rEPB_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPB_DATA_BUF)
#define     rEPB_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPB_IRQ_STAT)
#define     rEPB_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPB_IRQ_ENB)
#define     rEPB_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPB_DATA_CNT)
#define     rEPB_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPB_RSP_SC)
#define     rEPB_MPS		(*(unsigned int volatile *)REG_USBD_EPB_MPS)
#define     rEPB_CNT		(*(unsigned int volatile *)REG_USBD_EPB_CNT)
#define     rEPB_CFG		(*(unsigned int volatile *)REG_USBD_EPB_CFG)
#define     rEPB_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPB_START_ADDR)
#define     rEPB_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPB_END_ADDR)
#define     rEPC_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPC_DATA_BUF)
#define     rEPC_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPC_IRQ_STAT)
#define     rEPC_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPC_IRQ_ENB)
#define     rEPC_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPC_DATA_CNT)
#define     rEPC_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPC_RSP_SC)
#define     rEPC_MPS		(*(unsigned int volatile *)REG_USBD_EPC_MPS)
#define     rEPC_CNT		(*(unsigned int volatile *)REG_USBD_EPC_CNT)
#define     rEPC_CFG		(*(unsigned int volatile *)REG_USBD_EPC_CFG)
#define     rEPC_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPC_START_ADDR)
#define     rEPC_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPC_END_ADDR)
#define     rEPD_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPD_DATA_BUF)
#define     rEPD_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPD_IRQ_STAT)
#define     rEPD_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPD_IRQ_ENB)
#define     rEPD_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPD_DATA_CNT)
#define     rEPD_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPD_RSP_SC)
#define     rEPD_MPS		(*(unsigned int volatile *)REG_USBD_EPD_MPS)
#define     rEPD_CNT		(*(unsigned int volatile *)REG_USBD_EPD_CNT)
#define     rEPD_CFG		(*(unsigned int volatile *)REG_USBD_EPD_CFG)
#define     rEPD_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPD_START_ADDR)
#define     rEPD_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPD_END_ADDR)
#define     rEPE_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPE_DATA_BUF)
#define     rEPE_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPE_IRQ_STAT)
#define     rEPE_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPE_IRQ_ENB)
#define     rEPE_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPE_DATA_CNT)
#define     rEPE_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPE_RSP_SC)
#define     rEPE_MPS		(*(unsigned int volatile *)REG_USBD_EPE_MPS)
#define     rEPE_CNT		(*(unsigned int volatile *)REG_USBD_EPE_CNT)
#define     rEPE_CFG		(*(unsigned int volatile *)REG_USBD_EPE_CFG)
#define     rEPE_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPE_START_ADDR)
#define     rEPE_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPE_END_ADDR)
#define     rEPF_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPF_DATA_BUF)
#define     rEPF_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPF_IRQ_STAT)
#define     rEPF_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPF_IRQ_ENB)
#define     rEPF_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPF_DATA_CNT)
#define     rEPF_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPF_RSP_SC)
#define     rEPF_MPS		(*(unsigned int volatile *)REG_USBD_EPF_MPS)
#define     rEPF_CNT		(*(unsigned int volatile *)REG_USBD_EPF_CNT)
#define     rEPF_CFG		(*(unsigned int volatile *)REG_USBD_EPF_CFG)
#define     rEPF_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPF_START_ADDR)
#define     rEPF_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPF_END_ADDR)
#define     rEPG_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPG_DATA_BUF)
#define     rEPG_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPG_IRQ_STAT)
#define     rEPG_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPG_IRQ_ENB)
#define     rEPG_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPG_DATA_CNT)
#define     rEPG_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPG_RSP_SC)
#define     rEPG_MPS		(*(unsigned int volatile *)REG_USBD_EPG_MPS)
#define     rEPG_CNT		(*(unsigned int volatile *)REG_USBD_EPG_CNT)
#define     rEPG_CFG		(*(unsigned int volatile *)REG_USBD_EPG_CFG)
#define     rEPG_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPG_START_ADDR)
#define     rEPG_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPG_END_ADDR)
#define     rEPH_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPH_DATA_BUF)
#define     rEPH_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPH_IRQ_STAT)
#define     rEPH_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPH_IRQ_ENB)
#define     rEPH_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPH_DATA_CNT)
#define     rEPH_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPH_RSP_SC)
#define     rEPH_MPS		(*(unsigned int volatile *)REG_USBD_EPH_MPS)
#define     rEPH_CNT		(*(unsigned int volatile *)REG_USBD_EPH_CNT)
#define     rEPH_CFG		(*(unsigned int volatile *)REG_USBD_EPH_CFG)
#define     rEPH_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPH_START_ADDR)
#define     rEPH_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPH_END_ADDR)
#define     rEPI_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPI_DATA_BUF)
#define     rEPI_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPI_IRQ_STAT)
#define     rEPI_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPI_IRQ_ENB)
#define     rEPI_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPI_DATA_CNT)
#define     rEPI_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPI_RSP_SC)
#define     rEPI_MPS		(*(unsigned int volatile *)REG_USBD_EPI_MPS)
#define     rEPI_CNT		(*(unsigned int volatile *)REG_USBD_EPI_CNT)
#define     rEPI_CFG		(*(unsigned int volatile *)REG_USBD_EPI_CFG)
#define     rEPI_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPI_START_ADDR)
#define     rEPI_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPI_END_ADDR)
#define     rEPJ_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPJ_DATA_BUF)
#define     rEPJ_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPJ_IRQ_STAT)
#define     rEPJ_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPJ_IRQ_ENB)
#define     rEPJ_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPJ_DATA_CNT)
#define     rEPJ_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPJ_RSP_SC)
#define     rEPJ_MPS		(*(unsigned int volatile *)REG_USBD_EPJ_MPS)
#define     rEPJ_CNT		(*(unsigned int volatile *)REG_USBD_EPJ_CNT)
#define     rEPJ_CFG		(*(unsigned int volatile *)REG_USBD_EPJ_CFG)
#define     rEPJ_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPJ_START_ADDR)
#define     rEPJ_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPJ_END_ADDR)
#define     rEPK_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPK_DATA_BUF)
#define     rEPK_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPK_IRQ_STAT)
#define     rEPK_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPK_IRQ_ENB)
#define     rEPK_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPK_DATA_CNT)
#define     rEPK_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPK_RSP_SC)
#define     rEPK_MPS		(*(unsigned int volatile *)REG_USBD_EPK_MPS)
#define     rEPK_CNT		(*(unsigned int volatile *)REG_USBD_EPK_CNT)
#define     rEPK_CFG		(*(unsigned int volatile *)REG_USBD_EPK_CFG)
#define     rEPK_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPK_START_ADDR)
#define     rEPK_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPK_END_ADDR)
#define     rEPL_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPL_DATA_BUF)
#define     rEPL_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPL_IRQ_STAT)
#define     rEPL_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPL_IRQ_ENB)
#define     rEPL_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPL_DATA_CNT)
#define     rEPL_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPL_RSP_SC)
#define     rEPL_MPS		(*(unsigned int volatile *)REG_USBD_EPL_MPS)
#define     rEPL_CNT		(*(unsigned int volatile *)REG_USBD_EPL_CNT)
#define     rEPL_CFG		(*(unsigned int volatile *)REG_USBD_EPL_CFG)
#define     rEPL_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPL_START_ADDR)
#define     rEPL_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPL_END_ADDR)
#define     rAHB_DMA_ADDR	(*(unsigned int volatile *)REG_USBD_AHB_DMA_ADDR)
#define     rUSB_PHY_CTL	(*(unsigned int volatile *)REG_USB_PHY_CTL)


