OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*                                                              
  LCM Control Registers  
*/
#define     REG_LCM_DCCS	 	(LCM_BA+0x00)  /* Display Controller Control/Status Register */
#define     REG_LCM_DEV_CTRL 	(LCM_BA+0x04)  /* Display Output Device Control Register */
#define     REG_LCM_MPU_CMD	 	(LCM_BA+0x08)  /* MPU-Interface LCD Write Command */
#define     REG_LCM_INT_CS	 	(LCM_BA+0x0c)  /* Interrupt Control/Status Register */
#define     REG_LCM_CRTC_SIZE   (LCM_BA+0x10)  /* CRTC Display Size Control Register */
#define     REG_LCM_CRTC_DEND   (LCM_BA+0x14)  /* CRTC Display Enable End */
#define     REG_LCM_CRTC_HR	 	(LCM_BA+0x18)  /* CRTC Internal Horizontal Retrace Control Register */
#define     REG_LCM_CRTC_HSYNC  (LCM_BA+0x1C)  /* CRTC Horizontal Sync Control Register */
#define     REG_LCM_CRTC_VR	 	(LCM_BA+0x20)  /* CRTC Internal Vertical Retrace Control Register */
#define     REG_LCM_VA_BADDR0   (LCM_BA+0x24)  /* Video Stream Frame Buffer-0 Starting Address */
#define     REG_LCM_VA_BADDR1   (LCM_BA+0x28)  /* Video Stream Frame Buffer-1 Starting Address */
#define     REG_LCM_VA_FBCTRL   (LCM_BA+0x2C)  /* Video Stream Frame Buffer Control Register */
#define     REG_LCM_VA_SCALE    (LCM_BA+0x30)  /* Video Stream Scaling Control Register */
#define     REG_LCM_VA_WIN      (LCM_BA+0x38)  /* Image Stream Active Window Coordinates */
#define     REG_LCM_VA_STUFF    (LCM_BA+0x3C)  /* Image Stream Stuff Pixel */
#define     REG_LCM_OSD_WINS    (LCM_BA+0x40)  /* OSD Window Starting Coordinates */
#define     REG_LCM_OSD_WINE    (LCM_BA+0x44)  /* OSD Window Ending Coordinates */
#define     REG_LCM_OSD_BADDR   (LCM_BA+0x48)  /* OSD Stream Frame Buffer Starting Address */
#define     REG_LCM_OSD_FBCTRL  (LCM_BA+0x4c)  /* OSD Stream Frame Buffer Control Register */
#define     REG_LCM_OSD_OVERLAY (LCM_BA+0x50)  /* OSD Overlay Control Register */
#define     REG_LCM_OSD_CKEY    (LCM_BA+0x54)  /* OSD Overlay Color-Key Pattern Register */
#define     REG_LCM_OSD_CMASK   (LCM_BA+0x58)  /* OSD Overlay Color-Key Mask Register */
#define     REG_LCM_OSD_SKIP1   (LCM_BA+0x5C)  /* OSD Window Skip1 Register */
#define     REG_LCM_OSD_SKIP2   (LCM_BA+0x60)  /* OSD Window Skip2 Register */
#define     REG_LCM_OSD_SCALE   (LCM_BA+0x64)  /* OSD horizontal up scaling control register */
#define     REG_LCM_MPU_VSYNC   (LCM_BA+0x68)  /* MPU Vsync control register */
#define     REG_LCM_HC_CTRL	 	(LCM_BA+0x6C)  /* Hardware cursor control Register */
#define     REG_LCM_HC_POS    	(LCM_BA+0x70)  /* Hardware cursot tip point potison on va picture */
#define     REG_LCM_HC_WBCTRL   (LCM_BA+0x74)  /* Hardware Cursor Window Buffer Control Register */
#define     REG_LCM_HC_BADDR    (LCM_BA+0x78)  /* Hardware cursor memory base address register */
#define     REG_LCM_HC_COLOR0   (LCM_BA+0x7C)  /* Hardware cursor color ram register mapped to bpp = 0 */
#define     REG_LCM_HC_COLOR1   (LCM_BA+0x80)  /* Hardware cursor color ram register mapped to bpp = 1 */
#define     REG_LCM_HC_COLOR2   (LCM_BA+0x84)  /* Hardware cursor color ram register mapped to bpp = 2 */
#define     REG_LCM_HC_COLOR3   (LCM_BA+0x88)  /* Hardware cursor color ram register mapped to bpp = 3 */

#define     rDCCS			(*(unsigned int volatile *)REG_LCM_DCCS)
#define     rDEV_CTRL   	(*(unsigned int volatile *)REG_LCM_DEV_CTRL)
#define     rMPU_CMD	 	(*(unsigned int volatile *)REG_LCM_MPU_CMD)
#define     rINT_CS	 		(*(unsigned int volatile *)REG_LCM_INT_CS)
#define     rCRTC_SIZE   	(*(unsigned int volatile *)REG_LCM_CRTC_SIZE)
#define     rCRTC_DEND   	(*(unsigned int volatile *)REG_LCM_CRTC_DEND)
#define     rCRTC_HR	 	(*(unsigned int volatile *)REG_LCM_CRTC_HR)
#define     rCRTC_HSYNC  	(*(unsigned int volatile *)REG_LCM_CRTC_HSYNC)
#define     rCRTC_VR	 	(*(unsigned int volatile *)REG_LCM_CRTC_VR)
#define     rVA_BADDR0   	(*(unsigned int volatile *)REG_LCM_VA_BADDR0)
#define     rVA_BADDR1  	(*(unsigned int volatile *)REG_LCM_VA_BADDR1)
#define     rVA_FBCTRL   	(*(unsigned int volatile *)REG_LCM_VA_FBCTRL)
#define     rVA_SCALE    	(*(unsigned int volatile *)REG_LCM_VA_SCALE)
#define     rVA_WIN      	(*(unsigned int volatile *)REG_LCM_VA_WIN)
#define     rVA_STUFF    	(*(unsigned int volatile *)REG_LCM_VA_STUFF)
#define     rOSD_WINS    	(*(unsigned int volatile *)REG_LCM_OSD_WINS)
#define     rOSD_WINE    	(*(unsigned int volatile *)REG_LCM_OSD_WINE)
#define     rOSD_BADDR   	(*(unsigned int volatile *)REG_LCM_OSD_BADDR)
#define     rOSD_FBCTRL  	(*(unsigned int volatile *)REG_LCM_OSD_FBCTRL)
#define     rOSD_OVERLAY 	(*(unsigned int volatile *)REG_LCM_OSD_OVERLAY)
#define     rOSD_CKEY    	(*(unsigned int volatile *)REG_LCM_OSD_CKEY)
#define     rOSD_CMASK   	(*(unsigned int volatile *)REG_LCM_OSD_CMASK)
#define     rOSD_SKIP1   	(*(unsigned int volatile *)REG_LCM_OSD_SKIP1)
#define     rOSD_SKIP2   	(*(unsigned int volatile *)REG_LCM_OSD_SKIP2)
#define     rOSD_SCALE   	(*(unsigned int volatile *)REG_LCM_OSD_SCALE)
#define     rMPU_VSYNC   	(*(unsigned int volatile *)REG_LCM_MPU_VSYNC)
#define     rHC_CTRL	 	(*(unsigned int volatile *)REG_LCM_HC_CTRL)
#define     rHC_POS    		(*(unsigned int volatile *)REG_LCM_HC_POS)
#define     rHC_WBCTRL  	(*(unsigned int volatile *)REG_LCM_HC_WBCTRL)
#define     rHC_BADDR    	(*(unsigned int volatile *)REG_LCM_HC_BADDR)
#define     rHC_COLOR0   	(*(unsigned int volatile *)REG_LCM_HC_COLOR0)
#define     rHC_COLOR1   	(*(unsigned int volatile *)REG_LCM_HC_COLOR1)
#define     rHC_COLOR2   	(*(unsigned int volatile *)REG_LCM_HC_COLOR2)
#define     rHC_COLOR3   	(*(unsigned int volatile *)REG_LCM_HC_COLOR3)


/*
  Audio Interface Control Registers  
*/
#define     REG_ACTL_CON		(ACTL_BA+0x00)  /* Audio controller control register */
#define     REG_ACTL_RESET		(ACTL_BA+0x04)  /* Sub block reset control register */
#define     REG_ACTL_RDSTB		(ACTL_BA+0x08)  /* DMA destination base address register for record */
#define     REG_ACTL_RDST_LENGTH	(ACTL_BA+0x0C)  /* DMA destination length register for record */
#define     REG_ACTL_RDSTC          (ACTL_BA+0x10)  /* DMA destination current address */
#define     REG_ACTL_RSR		(ACTL_BA+0x14)  /* Record status register */
#define     REG_ACTL_PDSTB		(ACTL_BA+0x18)  /* DMA destination base address register for play */
#define     REG_ACTL_PDST_LENGTH	(ACTL_BA+0x1C)  /* DMA destination length register for play */
#define     REG_ACTL_PDSTC		(ACTL_BA+0x20)  /* DMA destination current address register for play */
#define     REG_ACTL_PSR		(ACTL_BA+0x24)  /* Play status register */
#define     REG_ACTL_IISCON		(ACTL_BA+0x28)  /* IIS control register */
#define     REG_ACTL_ACCON		(ACTL_BA+0x2C)  /* AC-link control register */
#define     REG_ACTL_ACOS0		(ACTL_BA+0x30)  /* AC-link out slot 0 */
#define     REG_ACTL_ACOS1		(ACTL_BA+0x34)  /* AC-link out slot 1 */
#define     REG_ACTL_ACOS2		(ACTL_BA+0x38)  /* AC-link out slot 2 */
#define     REG_ACTL_ACIS0		(ACTL_BA+0x3C)  /* AC-link in slot 0 */
#define     REG_ACTL_ACIS1		(ACTL_BA+0x40)  /* AC-link in slot 1 */
#define     REG_ACTL_ACIS2		(ACTL_BA+0x44)  /* AC-link in slot 2 */
#define     REG_ACTL_COUNTER	(ACTL_BA+0x48)  /* DMA counter down values */

#define     rACTL_CON			(*(unsigned int volatile *)REG_ACTL_CON)
#define     rACTL_RESET			(*(unsigned int volatile *)REG_ACTL_RESET)
#define     rACTL_RDSTB			(*(unsigned int volatile *)REG_ACTL_RDSTB)
#define     rACTL_RDST_LENGTH	(*(unsigned int volatile *)REG_ACTL_RDST_LENGTH)
#define     rACTL_RDSTC         (*(unsigned int volatile *)REG_ACTL_RDSTC)
#define     rACTL_RSR			(*(unsigned int volatile *)REG_ACTL_RSR)
#define     rACTL_PDSTB			(*(unsigned int volatile *)REG_ACTL_PDSTB)
#define     rACTL_PDST_LENGTH	(*(unsigned int volatile *)REG_ACTL_PDST_LENGTH)
#define     rACTL_PDSTC			(*(unsigned int volatile *)REG_ACTL_PDSTC)
#define     rACTL_PSR			(*(unsigned int volatile *)REG_ACTL_PSR)
#define     rACTL_IISCON		(*(unsigned int volatile *)REG_ACTL_IISCON)
#define     rACTL_ACCON			(*(unsigned int volatile *)REG_ACTL_ACCON)
#define     rACTL_ACOS0			(*(unsigned int volatile *)REG_ACTL_ACOS0)
#define     rACTL_ACOS1			(*(unsigned int volatile *)REG_ACTL_ACOS1)
#define     rACTL_ACOS2			(*(unsigned int volatile *)REG_ACTL_ACOS2)
#define     rACTL_ACIS0			(*(unsigned int volatile *)REG_ACTL_ACIS0)
#define     rACTL_ACIS1			(*(unsigned int volatile *)REG_ACTL_ACIS1)
#define     rACTL_ACIS2			(*(unsigned int volatile *)REG_ACTL_ACIS2)
#define     rACTL_COUNTER		(*(unsigned int volatile *)REG_ACTL_COUNTER)

