OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  JPEG Control Registers  
*/
//#define     REG_ACTL_CON		(JPEG_BA+0x00)  /* JPEG control register */




/*
  2-D Graphic Engine Control Registers  
*/
#define     REG_2D_GETG			(GE_BA+0x00)  /* Graphic Engine Trigger Control Register */
#define     REG_2D_GEXYSORG		(GE_BA+0x04)  /* Graphic Engine XY Mode Source Origin Starting Register */
#define     REG_2D_TileXY_VHSF	(GE_BA+0x08)  /* Graphic Engine Tile Width/Height or V/H Scale Factor N/M */
#define     REG_2D_GERRXY		(GE_BA+0x0C)  /* Graphic Engine Rotate Reference Point XY Address */
#define     REG_2D_GEINTS		(GE_BA+0x10)  /* Graphic Engine Interrupt Status Register */
#define     REG_2D_GEPLS		(GE_BA+0x14)  /* Graphic Engine Pattern Location Starting Address Register */
#define     REG_2D_GEBER		(GE_BA+0x18)  /* GE Bresenham Error Term Stepping Constant Register */
#define     REG_2D_GEBIR		(GE_BA+0x1C)  /* GE Bresenham Initial Error, Pixel Count Major M Register */
#define     REG_2D_GEC			(GE_BA+0x20)  /* Graphic Engine Control Register */
#define     REG_2D_GEBC			(GE_BA+0x24)  /* Graphic Engine Background Color Register */
#define     REG_2D_GEFC			(GE_BA+0x28)  /* Graphic Engine Foreground Color Register */
#define     REG_2D_GETC			(GE_BA+0x2C)  /* Graphic Engine Transparency Color Register */
#define     REG_2D_GETCM		(GE_BA+0x30)  /* Graphic Engine Transparency Color Mask Register */
#define     REG_2D_GEXYDORG		(GE_BA+0x34)  /* Graphic Engine XY Mode Display Origin Starting Register */
#define     REG_2D_GESDP		(GE_BA+0x38)  /* Graphic Engine Source/Destination Pitch Register */
#define     REG_2D_GESSXYL		(GE_BA+0x3C)  /* Graphic Engine Source Start XY/Linear Address Register */
#define     REG_2D_GEDSXYL		(GE_BA+0x40)  /* Graphic Engine Destination Start XY/Linear Register */
#define     REG_2D_GEDIXYL		(GE_BA+0x44)  /* Graphic Engine Dimension XY/Linear Register */
#define     REG_2D_GECBTL		(GE_BA+0x48)  /* Graphic Engine Clipping Boundary Top/Left Register */
#define     REG_2D_GECBBR		(GE_BA+0x4C)  /* Graphic Engine Clipping Boundary Bottom/Right Register */
#define     REG_2D_GEPTNA		(GE_BA+0x50)  /* Graphic Engine Pattern A Register */
#define     REG_2D_GEPTNB		(GE_BA+0x54)  /* Graphic Engine Pattern B Register */
#define     REG_2D_GEWPM		(GE_BA+0x58)  /* Graphic Engine Write Plane Mask Register */
#define     REG_2D_GEMC			(GE_BA+0x5C)  /* Graphic Engine Miscellaneous Control Register */

#define     rGETG			(*(unsigned int volatile *)REG_2D_GETG)
#define     rGEXYSORG		(*(unsigned int volatile *)REG_2D_GEXYSORG)
#define     rTileXY_VHSF	(*(unsigned int volatile *)REG_2D_TileXY_VHSF)
#define     rGERRXY			(*(unsigned int volatile *)REG_2D_GERRXY)
#define     rGEINTS			(*(unsigned int volatile *)REG_2D_GEINTS)
#define     rGEPLS			(*(unsigned int volatile *)REG_2D_GEPLS)
#define     rGEBER			(*(unsigned int volatile *)REG_2D_GEBER)
#define     rGEBIR			(*(unsigned int volatile *)REG_2D_GEBIR)
#define     rGEC			(*(unsigned int volatile *)REG_2D_GEC)
#define     rGEBC			(*(unsigned int volatile *)REG_2D_GEBC)
#define     rGEFC			(*(unsigned int volatile *)REG_2D_GEFC)
#define     rGETC			(*(unsigned int volatile *)REG_2D_GETC)
#define     rGETCM			(*(unsigned int volatile *)REG_2D_GETCM)
#define     rGEXYDORG		(*(unsigned int volatile *)REG_2D_GEXYDORG)
#define     rGESDP			(*(unsigned int volatile *)REG_2D_GESDP)
#define     rGESSXYL		(*(unsigned int volatile *)REG_2D_GESSXYL)
#define     rGEDSXYL		(*(unsigned int volatile *)REG_2D_GEDSXYL)
#define     rGEDIXYL		(*(unsigned int volatile *)REG_2D_GEDIXYL)
#define     rGECBTL			(*(unsigned int volatile *)REG_2D_GECBTL)
#define     rGECBBR			(*(unsigned int volatile *)REG_2D_GECBBR)
#define     rGEPTNA			(*(unsigned int volatile *)REG_2D_GEPTNA)
#define     rGEPTNB			(*(unsigned int volatile *)REG_2D_GEPTNB)
#define     rGEWPM			(*(unsigned int volatile *)REG_2D_GEWPM)
#define     rGEMC			(*(unsigned int volatile *)REG_2D_GEMC)


/*
  SD/SDIO Host Controller Registers  
*/
/* DMAC Control Registers*/
#define     REG_SD_FB0			(SDH_BA+0x000)  /* DMAC Control and Status Register */
#define     REG_SD_DMACCSR		(SDH_BA+0x400)  /* DMAC Control and Status Register */
#define     REG_SD_DMACSAR		(SDH_BA+0x408)  /* DMAC Transfer Starting Address Register */
#define     REG_SD_DMACBCR		(SDH_BA+0x40C)  /* DMAC Transfer Byte Count Register */
#define     REG_SD_DMACIER		(SDH_BA+0x410)  /* DMAC Interrupt Enable Register */
#define     REG_SD_DMACISR		(SDH_BA+0x414)  /* DMAC Interrupt Status Register */

#define     REG_SD_FMICSR		(SDH_BA+0x800)   /* Global Control and Status Register */
#define     REG_SD_FMIIER		(SDH_BA+0x804)   /* Global Interrupt Control Register */
#define     REG_SD_FMIISR		(SDH_BA+0x808)   /* Global Interrupt Status Register */

/* Secure Digit Registers */
#define     REG_SDCSR	    	(SDH_BA+0x820)   /* SD control and status register */
#define     REG_SDARG	    	(SDH_BA+0x824)   /* SD command argument register */
#define     REG_SDIER		    (SDH_BA+0x828)   /* SD interrupt enable register */
#define     REG_SDISR		    (SDH_BA+0x82C)   /* SD interrupt status register */
#define     REG_SDRSP0		    (SDH_BA+0x830)   /* SD receive response token register 0 */
#define     REG_SDRSP1		    (SDH_BA+0x834)   /* SD receive response token register 1 */
#define     REG_SDBLEN		    (SDH_BA+0x838)   /* SD block length register */
#define     REG_SDTMOUT	    	(SDH_BA+0x83C)   /* SD block length register */
 
/* DMAC Control Registers*/
#define     rSD_FB0		    	(*(unsigned int volatile *)REG_SD_FB0)
#define     rSD_DMACCSR	    	(*(unsigned int volatile *)REG_SD_DMACCSR)
#define     rSD_DMACSAR	    	(*(unsigned int volatile *)REG_SD_DMACSAR)
#define     rSD_DMACBCR	    	(*(unsigned int volatile *)REG_SD_DMACBCR)
#define     rSD_DMACIER	    	(*(unsigned int volatile *)REG_SD_DMACIER)
#define     rSD_DMACISR	    	(*(unsigned int volatile *)REG_SD_DMACISR)

#define     rSD_FMICSR	    	(*(unsigned int volatile *)REG_SD_FMICSR)
#define     rSD_FMIIER	    	(*(unsigned int volatile *)REG_SD_FMIIER)
#define     rSD_FMIISR	    	(*(unsigned int volatile *)REG_SD_FMIISR)

/* Secure Digit Registers */
#define     rSDCSR		    	(*(unsigned int volatile *)REG_SDCSR)
#define     rSDARG		    	(*(unsigned int volatile *)REG_SDARG)
#define     rSDIER		    	(*(unsigned int volatile *)REG_SDIER)
#define     rSDISR		    	(*(unsigned int volatile *)REG_SDISR)
#define     rSDRSP0		    	(*(unsigned int volatile *)REG_SDRSP0)
#define     rSDRSP1		    	(*(unsigned int volatile *)REG_SDRSP1)
#define     rSDBLEN		    	(*(unsigned int volatile *)REG_SDBLEN)
#define     rSDTMOUT	    	(*(unsigned int volatile *)REG_SDTMOUT)


