OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/* NAND-type Flash BCH Error Data Registers */
#define     rBCH_ECC_DATA0	    (*(unsigned int volatile *)REG_BCH_ECC_DATA0)
#define     rBCH_ECC_DATA1  	(*(unsigned int volatile *)REG_BCH_ECC_DATA1)
#define     rBCH_ECC_DATA2	    (*(unsigned int volatile *)REG_BCH_ECC_DATA2)
#define     rBCH_ECC_DATA3	    (*(unsigned int volatile *)REG_BCH_ECC_DATA3)
#define     rBCH_ECC_DATA4  	(*(unsigned int volatile *)REG_BCH_ECC_DATA4)
#define     rBCH_ECC_DATA5	    (*(unsigned int volatile *)REG_BCH_ECC_DATA5)

/* NAND-type Flash Redundant Area Registers */
#define     rSMRA0			    (*(unsigned int volatile *)REG_SMRA0)


/*
  UART0 Control Registers
*/
#define     REG_UART0_RBR		(UART0_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART0_THR		(UART0_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART0_IER		(UART0_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART0_FCR		(UART0_BA+0x08)  /* FIFO Control Register */
#define     REG_UART0_LCR		(UART0_BA+0x0C)  /* Line Control Register */
#define     REG_UART0_MCR		(UART0_BA+0x10)  /* Modem Control Register */
#define     REG_UART0_MSR		(UART0_BA+0x14)  /* MODEM Status Register */
#define     REG_UART0_FSR		(UART0_BA+0x18)  /* FIFO Status Register */
#define     REG_UART0_ISR		(UART0_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART0_TOR		(UART0_BA+0x20)  /* Time Out Register */
#define     REG_UART0_BAUD		(UART0_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART0_IRCR		(UART0_BA+0x28)  /* IrDA Control Register */
#define     REG_UART0_ALT_CSR	(UART0_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART0_FUN_SEL	(UART0_BA+0x30)  /* Function Select Register */
#define     REG_UART0_LIN_CTL	(UART0_BA+0x34)  /* LIN Control Register */
#define     REG_UART0_LIN_SR	(UART0_BA+0x38)  /* LIN Status Register */
#define     REG_UART0_DEBUG		(UART0_BA+0x3C)  /* Debug Register */
#define     REG_UART0_SC_CTL	(UART0_BA+0x40)  /* SC Control Register */
#define     REG_UART0_SC_FSR	(UART0_BA+0x44)  /* SC Flag Status Register */


#define     rUART0_RBR		(*(unsigned int volatile *)REG_UART0_RBR)
#define     rUART0_THR		(*(unsigned int volatile *)REG_UART0_THR)
#define     rUART0_IER		(*(unsigned int volatile *)REG_UART0_IER)
#define     rUART0_FCR		(*(unsigned int volatile *)REG_UART0_FCR)
#define     rUART0_LCR		(*(unsigned int volatile *)REG_UART0_LCR)
#define     rUART0_MCR		(*(unsigned int volatile *)REG_UART0_MCR)
#define     rUART0_MSR		(*(unsigned int volatile *)REG_UART0_MSR)
#define     rUART0_FSR		(*(unsigned int volatile *)REG_UART0_FSR)
#define     rUART0_ISR		(*(unsigned int volatile *)REG_UART0_ISR)
#define     rUART0_TOR		(*(unsigned int volatile *)REG_UART0_TOR)
#define     rUART0_BAUD		(*(unsigned int volatile *)REG_UART0_BAUD)
#define     rUART0_IRCR		(*(unsigned int volatile *)REG_UART0_IRCR)
#define     rUART0_ALT_CSR	(*(unsigned int volatile *)REG_UART0_ALT_CSR)
#define     rUART0_FUN_SEL	(*(unsigned int volatile *)REG_UART0_FUN_SEL)
#define     rUART0_LIN_CTL	(*(unsigned int volatile *)REG_UART0_LIN_CTL)
#define     rUART0_LIN_SR	(*(unsigned int volatile *)REG_UART0_LIN_SR)
#define     rUART0_DEBUG	(*(unsigned int volatile *)REG_UART0_DEBUG)
#define     rUART0_SC_CTL	(*(unsigned int volatile *)REG_UART0_SC_CTL)
#define     rUART0_SC_FSR	(*(unsigned int volatile *)REG_UART0_SC_FSR)

/*
  UART1 Control Registers
*/
#define     REG_UART1_RBR		(UART1_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART1_THR		(UART1_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART1_IER		(UART1_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART1_FCR		(UART1_BA+0x08)  /* FIFO Control Register */
#define     REG_UART1_LCR		(UART1_BA+0x0C)  /* Line Control Register */
#define     REG_UART1_MCR		(UART1_BA+0x10)  /* Modem Control Register */
#define     REG_UART1_MSR		(UART1_BA+0x14)  /* MODEM Status Register */
#define     REG_UART1_FSR		(UART1_BA+0x18)  /* FIFO Status Register */
#define     REG_UART1_ISR		(UART1_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART1_TOR		(UART1_BA+0x20)  /* Time Out Register */
#define     REG_UART1_BAUD		(UART1_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART1_IRCR		(UART1_BA+0x28)  /* IrDA Control Register */
#define     REG_UART1_ALT_CSR	(UART1_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART1_FUN_SEL	(UART1_BA+0x30)  /* Function Select Register */
#define     REG_UART1_LIN_CTL	(UART1_BA+0x34)  /* LIN Control Register */
#define     REG_UART1_LIN_SR	(UART1_BA+0x38)  /* LIN Status Register */
#define     REG_UART1_DEBUG		(UART1_BA+0x3C)  /* Debug Register */
#define     REG_UART1_SC_CTL	(UART1_BA+0x40)  /* SC Control Register */
#define     REG_UART1_SC_FSR	(UART1_BA+0x44)  /* SC Flag Status Register */


#define     rUART1_RBR		(*(unsigned int volatile *)REG_UART1_RBR)
#define     rUART1_THR		(*(unsigned int volatile *)REG_UART1_THR)
#define     rUART1_IER		(*(unsigned int volatile *)REG_UART1_IER)
#define     rUART1_FCR		(*(unsigned int volatile *)REG_UART1_FCR)
#define     rUART1_LCR		(*(unsigned int volatile *)REG_UART1_LCR)
#define     rUART1_MCR		(*(unsigned int volatile *)REG_UART1_MCR)
#define     rUART1_MSR		(*(unsigned int volatile *)REG_UART1_MSR)
#define     rUART1_FSR		(*(unsigned int volatile *)REG_UART1_FSR)
#define     rUART1_ISR		(*(unsigned int volatile *)REG_UART1_ISR)
#define     rUART1_TOR		(*(unsigned int volatile *)REG_UART1_TOR)
#define     rUART1_BAUD		(*(unsigned int volatile *)REG_UART1_BAUD)
#define     rUART1_IRCR		(*(unsigned int volatile *)REG_UART1_IRCR)
#define     rUART1_ALT_CSR	(*(unsigned int volatile *)REG_UART1_ALT_CSR)
#define     rUART1_FUN_SEL	(*(unsigned int volatile *)REG_UART1_FUN_SEL)
#define     rUART1_LIN_CTL	(*(unsigned int volatile *)REG_UART1_LIN_CTL)
#define     rUART1_LIN_SR	(*(unsigned int volatile *)REG_UART1_LIN_SR)
#define     rUART1_DEBUG	(*(unsigned int volatile *)REG_UART1_DEBUG)
#define     rUART1_SC_CTL	(*(unsigned int volatile *)REG_UART1_SC_CTL)
#define     rUART1_SC_FSR	(*(unsigned int volatile *)REG_UART1_SC_FSR)


