OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  UART2 Control Registers
*/
#define     REG_UART2_RBR		(UART2_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART2_THR		(UART2_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART2_IER		(UART2_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART2_FCR		(UART2_BA+0x08)  /* FIFO Control Register */
#define     REG_UART2_LCR		(UART2_BA+0x0C)  /* Line Control Register */
#define     REG_UART2_MCR		(UART2_BA+0x10)  /* Modem Control Register */
#define     REG_UART2_MSR		(UART2_BA+0x14)  /* MODEM Status Register */
#define     REG_UART2_FSR		(UART2_BA+0x18)  /* FIFO Status Register */
#define     REG_UART2_ISR		(UART2_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART2_TOR		(UART2_BA+0x20)  /* Time Out Register */
#define     REG_UART2_BAUD		(UART2_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART2_IRCR		(UART2_BA+0x28)  /* IrDA Control Register */
#define     REG_UART2_ALT_CSR	(UART2_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART2_FUN_SEL	(UART2_BA+0x30)  /* Function Select Register */
#define     REG_UART2_LIN_CTL	(UART2_BA+0x34)  /* LIN Control Register */
#define     REG_UART2_LIN_SR	(UART2_BA+0x38)  /* LIN Status Register */
#define     REG_UART2_DEBUG		(UART2_BA+0x3C)  /* Debug Register */
#define     REG_UART2_SC_CTL	(UART2_BA+0x40)  /* SC Control Register */
#define     REG_UART2_SC_FSR	(UART2_BA+0x44)  /* SC Flag Status Register */


#define     rUART2_RBR		(*(unsigned int volatile *)REG_UART2_RBR)
#define     rUART2_THR		(*(unsigned int volatile *)REG_UART2_THR)
#define     rUART2_IER		(*(unsigned int volatile *)REG_UART2_IER)
#define     rUART2_FCR		(*(unsigned int volatile *)REG_UART2_FCR)
#define     rUART2_LCR		(*(unsigned int volatile *)REG_UART2_LCR)
#define     rUART2_MCR		(*(unsigned int volatile *)REG_UART2_MCR)
#define     rUART2_MSR		(*(unsigned int volatile *)REG_UART2_MSR)
#define     rUART2_FSR		(*(unsigned int volatile *)REG_UART2_FSR)
#define     rUART2_ISR		(*(unsigned int volatile *)REG_UART2_ISR)
#define     rUART2_TOR		(*(unsigned int volatile *)REG_UART2_TOR)
#define     rUART2_BAUD		(*(unsigned int volatile *)REG_UART2_BAUD)
#define     rUART2_IRCR		(*(unsigned int volatile *)REG_UART2_IRCR)
#define     rUART2_ALT_CSR	(*(unsigned int volatile *)REG_UART2_ALT_CSR)
#define     rUART2_FUN_SEL	(*(unsigned int volatile *)REG_UART2_FUN_SEL)
#define     rUART2_LIN_CTL	(*(unsigned int volatile *)REG_UART2_LIN_CTL)
#define     rUART2_LIN_SR	(*(unsigned int volatile *)REG_UART2_LIN_SR)
#define     rUART2_DEBUG	(*(unsigned int volatile *)REG_UART2_DEBUG)
#define     rUART2_SC_CTL	(*(unsigned int volatile *)REG_UART2_SC_CTL)
#define     rUART2_SC_FSR	(*(unsigned int volatile *)REG_UART2_SC_FSR)

/*
  UART3 Control Registers
*/
#define     REG_UART3_RBR		(UART3_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART3_THR		(UART3_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART3_IER		(UART3_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART3_FCR		(UART3_BA+0x08)  /* FIFO Control Register */
#define     REG_UART3_LCR		(UART3_BA+0x0C)  /* Line Control Register */
#define     REG_UART3_MCR		(UART3_BA+0x10)  /* Modem Control Register */
#define     REG_UART3_MSR		(UART3_BA+0x14)  /* MODEM Status Register */
#define     REG_UART3_FSR		(UART3_BA+0x18)  /* FIFO Status Register */
#define     REG_UART3_ISR		(UART3_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART3_TOR		(UART3_BA+0x20)  /* Time Out Register */
#define     REG_UART3_BAUD		(UART3_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART3_IRCR		(UART3_BA+0x28)  /* IrDA Control Register */
#define     REG_UART3_ALT_CSR	(UART3_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART3_FUN_SEL	(UART3_BA+0x30)  /* Function Select Register */
#define     REG_UART3_LIN_CTL	(UART3_BA+0x34)  /* LIN Control Register */
#define     REG_UART3_LIN_SR	(UART3_BA+0x38)  /* LIN Status Register */
#define     REG_UART3_DEBUG		(UART3_BA+0x3C)  /* Debug Register */
#define     REG_UART3_SC_CTL	(UART3_BA+0x40)  /* SC Control Register */
#define     REG_UART3_SC_FSR	(UART3_BA+0x44)  /* SC Flag Status Register */


#define     rUART3_RBR		(*(unsigned int volatile *)REG_UART3_RBR)
#define     rUART3_THR		(*(unsigned int volatile *)REG_UART3_THR)
#define     rUART3_IER		(*(unsigned int volatile *)REG_UART3_IER)
#define     rUART3_FCR		(*(unsigned int volatile *)REG_UART3_FCR)
#define     rUART3_LCR		(*(unsigned int volatile *)REG_UART3_LCR)
#define     rUART3_MCR		(*(unsigned int volatile *)REG_UART3_MCR)
#define     rUART3_MSR		(*(unsigned int volatile *)REG_UART3_MSR)
#define     rUART3_FSR		(*(unsigned int volatile *)REG_UART3_FSR)
#define     rUART3_ISR		(*(unsigned int volatile *)REG_UART3_ISR)
#define     rUART3_TOR		(*(unsigned int volatile *)REG_UART3_TOR)
#define     rUART3_BAUD		(*(unsigned int volatile *)REG_UART3_BAUD)
#define     rUART3_IRCR		(*(unsigned int volatile *)REG_UART3_IRCR)
#define     rUART3_ALT_CSR	(*(unsigned int volatile *)REG_UART3_ALT_CSR)
#define     rUART3_FUN_SEL	(*(unsigned int volatile *)REG_UART3_FUN_SEL)
#define     rUART3_LIN_CTL	(*(unsigned int volatile *)REG_UART3_LIN_CTL)
#define     rUART3_LIN_SR	(*(unsigned int volatile *)REG_UART3_LIN_SR)
#define     rUART3_DEBUG	(*(unsigned int volatile *)REG_UART3_DEBUG)
#define     rUART3_SC_CTL	(*(unsigned int volatile *)REG_UART3_SC_CTL)
#define     rUART3_SC_FSR	(*(unsigned int volatile *)REG_UART3_SC_FSR)


/*
  UART4 Control Registers
*/
#define     REG_UART4_RBR		(UART4_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART4_THR		(UART4_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART4_IER		(UART4_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART4_FCR		(UART4_BA+0x08)  /* FIFO Control Register */
#define     REG_UART4_LCR		(UART4_BA+0x0C)  /* Line Control Register */
#define     REG_UART4_MCR		(UART4_BA+0x10)  /* Modem Control Register */
#define     REG_UART4_MSR		(UART4_BA+0x14)  /* MODEM Status Register */
#define     REG_UART4_FSR		(UART4_BA+0x18)  /* FIFO Status Register */
#define     REG_UART4_ISR		(UART4_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART4_TOR		(UART4_BA+0x20)  /* Time Out Register */
#define     REG_UART4_BAUD		(UART4_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART4_IRCR		(UART4_BA+0x28)  /* IrDA Control Register */
#define     REG_UART4_ALT_CSR	(UART4_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART4_FUN_SEL	(UART4_BA+0x30)  /* Function Select Register */
#define     REG_UART4_LIN_CTL	(UART4_BA+0x34)  /* LIN Control Register */
#define     REG_UART4_LIN_SR	(UART4_BA+0x38)  /* LIN Status Register */
#define     REG_UART4_DEBUG		(UART4_BA+0x3C)  /* Debug Register */
#define     REG_UART4_SC_CTL	(UART4_BA+0x40)  /* SC Control Register */
#define     REG_UART4_SC_FSR	(UART4_BA+0x44)  /* SC Flag Status Register */


#define     rUART4_RBR		(*(unsigned int volatile *)REG_UART4_RBR)
#define     rUART4_THR		(*(unsigned int volatile *)REG_UART4_THR)
#define     rUART4_IER		(*(unsigned int volatile *)REG_UART4_IER)
#define     rUART4_FCR		(*(unsigned int volatile *)REG_UART4_FCR)
#define     rUART4_LCR		(*(unsigned int volatile *)REG_UART4_LCR)
#define     rUART4_MCR		(*(unsigned int volatile *)REG_UART4_MCR)
#define     rUART4_MSR		(*(unsigned int volatile *)REG_UART4_MSR)
#define     rUART4_FSR		(*(unsigned int volatile *)REG_UART4_FSR)
#define     rUART4_ISR		(*(unsigned int volatile *)REG_UART4_ISR)
#define     rUART4_TOR		(*(unsigned int volatile *)REG_UART4_TOR)
#define     rUART4_BAUD		(*(unsigned int volatile *)REG_UART4_BAUD)
#define     rUART4_IRCR		(*(unsigned int volatile *)REG_UART4_IRCR)
#define     rUART4_ALT_CSR	(*(unsigned int volatile *)REG_UART4_ALT_CSR)
#define     rUART4_FUN_SEL	(*(unsigned int volatile *)REG_UART4_FUN_SEL)
#define     rUART4_LIN_CTL	(*(unsigned int volatile *)REG_UART4_LIN_CTL)
#define     rUART4_LIN_SR	(*(unsigned int volatile *)REG_UART4_LIN_SR)
#define     rUART4_DEBUG	(*(unsigned int volatile *)REG_UART4_DEBUG)
#define     rUART4_SC_CTL	(*(unsigned int volatile *)REG_UART4_SC_CTL)
#define     rUART4_SC_FSR	(*(unsigned int volatile *)REG_UART4_SC_FSR)

