OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  UART5 Control Registers
*/
#define     REG_UART5_RBR		(UART5_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART5_THR		(UART5_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART5_IER		(UART5_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART5_FCR		(UART5_BA+0x08)  /* FIFO Control Register */
#define     REG_UART5_LCR		(UART5_BA+0x0C)  /* Line Control Register */
#define     REG_UART5_MCR		(UART5_BA+0x10)  /* Modem Control Register */
#define     REG_UART5_MSR		(UART5_BA+0x14)  /* MODEM Status Register */
#define     REG_UART5_FSR		(UART5_BA+0x18)  /* FIFO Status Register */
#define     REG_UART5_ISR		(UART5_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART5_TOR		(UART5_BA+0x20)  /* Time Out Register */
#define     REG_UART5_BAUD		(UART5_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART5_IRCR		(UART5_BA+0x28)  /* IrDA Control Register */
#define     REG_UART5_ALT_CSR	(UART5_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART5_FUN_SEL	(UART5_BA+0x30)  /* Function Select Register */
#define     REG_UART5_LIN_CTL	(UART5_BA+0x34)  /* LIN Control Register */
#define     REG_UART5_LIN_SR	(UART5_BA+0x38)  /* LIN Status Register */
#define     REG_UART5_DEBUG		(UART5_BA+0x3C)  /* Debug Register */
#define     REG_UART5_SC_CTL	(UART5_BA+0x40)  /* SC Control Register */
#define     REG_UART5_SC_FSR	(UART5_BA+0x44)  /* SC Flag Status Register */


#define     rUART5_RBR		(*(unsigned int volatile *)REG_UART5_RBR)
#define     rUART5_THR		(*(unsigned int volatile *)REG_UART5_THR)
#define     rUART5_IER		(*(unsigned int volatile *)REG_UART5_IER)
#define     rUART5_FCR		(*(unsigned int volatile *)REG_UART5_FCR)
#define     rUART5_LCR		(*(unsigned int volatile *)REG_UART5_LCR)
#define     rUART5_MCR		(*(unsigned int volatile *)REG_UART5_MCR)
#define     rUART5_MSR		(*(unsigned int volatile *)REG_UART5_MSR)
#define     rUART5_FSR		(*(unsigned int volatile *)REG_UART5_FSR)
#define     rUART5_ISR		(*(unsigned int volatile *)REG_UART5_ISR)
#define     rUART5_TOR		(*(unsigned int volatile *)REG_UART5_TOR)
#define     rUART5_BAUD		(*(unsigned int volatile *)REG_UART5_BAUD)
#define     rUART5_IRCR		(*(unsigned int volatile *)REG_UART5_IRCR)
#define     rUART5_ALT_CSR	(*(unsigned int volatile *)REG_UART5_ALT_CSR)
#define     rUART5_FUN_SEL	(*(unsigned int volatile *)REG_UART5_FUN_SEL)
#define     rUART5_LIN_CTL	(*(unsigned int volatile *)REG_UART5_LIN_CTL)
#define     rUART5_LIN_SR	(*(unsigned int volatile *)REG_UART5_LIN_SR)
#define     rUART5_DEBUG	(*(unsigned int volatile *)REG_UART5_DEBUG)
#define     rUART5_SC_CTL	(*(unsigned int volatile *)REG_UART5_SC_CTL)
#define     rUART5_SC_FSR	(*(unsigned int volatile *)REG_UART5_SC_FSR)

/*
  UART6 Control Registers
*/
#define     REG_UART6_RBR		(UART6_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART6_THR		(UART6_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART6_IER		(UART6_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART6_FCR		(UART6_BA+0x08)  /* FIFO Control Register */
#define     REG_UART6_LCR		(UART6_BA+0x0C)  /* Line Control Register */
#define     REG_UART6_MCR		(UART6_BA+0x10)  /* Modem Control Register */
#define     REG_UART6_MSR		(UART6_BA+0x14)  /* MODEM Status Register */
#define     REG_UART6_FSR		(UART6_BA+0x18)  /* FIFO Status Register */
#define     REG_UART6_ISR		(UART6_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART6_TOR		(UART6_BA+0x20)  /* Time Out Register */
#define     REG_UART6_BAUD		(UART6_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART6_IRCR		(UART6_BA+0x28)  /* IrDA Control Register */
#define     REG_UART6_ALT_CSR	(UART6_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART6_FUN_SEL	(UART6_BA+0x30)  /* Function Select Register */
#define     REG_UART6_LIN_CTL	(UART6_BA+0x34)  /* LIN Control Register */
#define     REG_UART6_LIN_SR	(UART6_BA+0x38)  /* LIN Status Register */
#define     REG_UART6_DEBUG		(UART6_BA+0x3C)  /* Debug Register */
#define     REG_UART6_SC_CTL	(UART6_BA+0x40)  /* SC Control Register */
#define     REG_UART6_SC_FSR	(UART6_BA+0x44)  /* SC Flag Status Register */


#define     rUART6_RBR		(*(unsigned int volatile *)REG_UART6_RBR)
#define     rUART6_THR		(*(unsigned int volatile *)REG_UART6_THR)
#define     rUART6_IER		(*(unsigned int volatile *)REG_UART6_IER)
#define     rUART6_FCR		(*(unsigned int volatile *)REG_UART6_FCR)
#define     rUART6_LCR		(*(unsigned int volatile *)REG_UART6_LCR)
#define     rUART6_MCR		(*(unsigned int volatile *)REG_UART6_MCR)
#define     rUART6_MSR		(*(unsigned int volatile *)REG_UART6_MSR)
#define     rUART6_FSR		(*(unsigned int volatile *)REG_UART6_FSR)
#define     rUART6_ISR		(*(unsigned int volatile *)REG_UART6_ISR)
#define     rUART6_TOR		(*(unsigned int volatile *)REG_UART6_TOR)
#define     rUART6_BAUD		(*(unsigned int volatile *)REG_UART6_BAUD)
#define     rUART6_IRCR		(*(unsigned int volatile *)REG_UART6_IRCR)
#define     rUART6_ALT_CSR	(*(unsigned int volatile *)REG_UART6_ALT_CSR)
#define     rUART6_FUN_SEL	(*(unsigned int volatile *)REG_UART6_FUN_SEL)
#define     rUART6_LIN_CTL	(*(unsigned int volatile *)REG_UART6_LIN_CTL)
#define     rUART6_LIN_SR	(*(unsigned int volatile *)REG_UART6_LIN_SR)
#define     rUART6_DEBUG	(*(unsigned int volatile *)REG_UART6_DEBUG)
#define     rUART6_SC_CTL	(*(unsigned int volatile *)REG_UART6_SC_CTL)
#define     rUART6_SC_FSR	(*(unsigned int volatile *)REG_UART6_SC_FSR)

/*
  UART7 Control Registers
*/
#define     REG_UART7_RBR		(UART7_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART7_THR		(UART7_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART7_IER		(UART7_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART7_FCR		(UART7_BA+0x08)  /* FIFO Control Register */
#define     REG_UART7_LCR		(UART7_BA+0x0C)  /* Line Control Register */
#define     REG_UART7_MCR		(UART7_BA+0x10)  /* Modem Control Register */
#define     REG_UART7_MSR		(UART7_BA+0x14)  /* MODEM Status Register */
#define     REG_UART7_FSR		(UART7_BA+0x18)  /* FIFO Status Register */
#define     REG_UART7_ISR		(UART7_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART7_TOR		(UART7_BA+0x20)  /* Time Out Register */
#define     REG_UART7_BAUD		(UART7_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART7_IRCR		(UART7_BA+0x28)  /* IrDA Control Register */
#define     REG_UART7_ALT_CSR	(UART7_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART7_FUN_SEL	(UART7_BA+0x30)  /* Function Select Register */
#define     REG_UART7_LIN_CTL	(UART7_BA+0x34)  /* LIN Control Register */
#define     REG_UART7_LIN_SR	(UART7_BA+0x38)  /* LIN Status Register */
#define     REG_UART7_DEBUG		(UART7_BA+0x3C)  /* Debug Register */
#define     REG_UART7_SC_CTL	(UART7_BA+0x40)  /* SC Control Register */
#define     REG_UART7_SC_FSR	(UART7_BA+0x44)  /* SC Flag Status Register */


#define     rUART7_RBR		(*(unsigned int volatile *)REG_UART7_RBR)
#define     rUART7_THR		(*(unsigned int volatile *)REG_UART7_THR)
#define     rUART7_IER		(*(unsigned int volatile *)REG_UART7_IER)
#define     rUART7_FCR		(*(unsigned int volatile *)REG_UART7_FCR)
#define     rUART7_LCR		(*(unsigned int volatile *)REG_UART7_LCR)
#define     rUART7_MCR		(*(unsigned int volatile *)REG_UART7_MCR)
#define     rUART7_MSR		(*(unsigned int volatile *)REG_UART7_MSR)
#define     rUART7_FSR		(*(unsigned int volatile *)REG_UART7_FSR)
#define     rUART7_ISR		(*(unsigned int volatile *)REG_UART7_ISR)
#define     rUART7_TOR		(*(unsigned int volatile *)REG_UART7_TOR)
#define     rUART7_BAUD		(*(unsigned int volatile *)REG_UART7_BAUD)
#define     rUART7_IRCR		(*(unsigned int volatile *)REG_UART7_IRCR)
#define     rUART7_ALT_CSR	(*(unsigned int volatile *)REG_UART7_ALT_CSR)
#define     rUART7_FUN_SEL	(*(unsigned int volatile *)REG_UART7_FUN_SEL)
#define     rUART7_LIN_CTL	(*(unsigned int volatile *)REG_UART7_LIN_CTL)
#define     rUART7_LIN_SR	(*(unsigned int volatile *)REG_UART7_LIN_SR)
#define     rUART7_DEBUG	(*(unsigned int volatile *)REG_UART7_DEBUG)
#define     rUART7_SC_CTL	(*(unsigned int volatile *)REG_UART7_SC_CTL)
#define     rUART7_SC_FSR	(*(unsigned int volatile *)REG_UART7_SC_FSR)

