OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  UART8 Control Registers
*/
#define     REG_UART8_RBR		(UART8_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART8_THR		(UART8_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART8_IER		(UART8_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART8_FCR		(UART8_BA+0x08)  /* FIFO Control Register */
#define     REG_UART8_LCR		(UART8_BA+0x0C)  /* Line Control Register */
#define     REG_UART8_MCR		(UART8_BA+0x10)  /* Modem Control Register */
#define     REG_UART8_MSR		(UART8_BA+0x14)  /* MODEM Status Register */
#define     REG_UART8_FSR		(UART8_BA+0x18)  /* FIFO Status Register */
#define     REG_UART8_ISR		(UART8_BA+0x1C)  /* Interrupt Status Register */
#define     REG_UART8_TOR		(UART8_BA+0x20)  /* Time Out Register */
#define     REG_UART8_BAUD		(UART8_BA+0x24)  /* Baud Rate Divisor Register */
#define     REG_UART8_IRCR		(UART8_BA+0x28)  /* IrDA Control Register */
#define     REG_UART8_ALT_CSR	(UART8_BA+0x2C)  /* Alternate Control/Status Register */
#define     REG_UART8_FUN_SEL	(UART8_BA+0x30)  /* Function Select Register */
#define     REG_UART8_LIN_CTL	(UART8_BA+0x34)  /* LIN Control Register */
#define     REG_UART8_LIN_SR	(UART8_BA+0x38)  /* LIN Status Register */
#define     REG_UART8_DEBUG		(UART8_BA+0x3C)  /* Debug Register */
#define     REG_UART8_SC_CTL	(UART8_BA+0x40)  /* SC Control Register */
#define     REG_UART8_SC_FSR	(UART8_BA+0x44)  /* SC Flag Status Register */


#define     rUART8_RBR		(*(unsigned int volatile *)REG_UART8_RBR)
#define     rUART8_THR		(*(unsigned int volatile *)REG_UART8_THR)
#define     rUART8_IER		(*(unsigned int volatile *)REG_UART8_IER)
#define     rUART8_FCR		(*(unsigned int volatile *)REG_UART8_FCR)
#define     rUART8_LCR		(*(unsigned int volatile *)REG_UART8_LCR)
#define     rUART8_MCR		(*(unsigned int volatile *)REG_UART8_MCR)
#define     rUART8_MSR		(*(unsigned int volatile *)REG_UART8_MSR)
#define     rUART8_FSR		(*(unsigned int volatile *)REG_UART8_FSR)
#define     rUART8_ISR		(*(unsigned int volatile *)REG_UART8_ISR)
#define     rUART8_TOR		(*(unsigned int volatile *)REG_UART8_TOR)
#define     rUART8_BAUD		(*(unsigned int volatile *)REG_UART8_BAUD)
#define     rUART8_IRCR		(*(unsigned int volatile *)REG_UART8_IRCR)
#define     rUART8_ALT_CSR	(*(unsigned int volatile *)REG_UART8_ALT_CSR)
#define     rUART8_FUN_SEL	(*(unsigned int volatile *)REG_UART8_FUN_SEL)
#define     rUART8_LIN_CTL	(*(unsigned int volatile *)REG_UART8_LIN_CTL)
#define     rUART8_LIN_SR	(*(unsigned int volatile *)REG_UART8_LIN_SR)
#define     rUART8_DEBUG	(*(unsigned int volatile *)REG_UART8_DEBUG)
#define     rUART8_SC_CTL	(*(unsigned int volatile *)REG_UART8_SC_CTL)
#define     rUART8_SC_FSR	(*(unsigned int volatile *)REG_UART8_SC_FSR)

/* 
  Timer Control Registers 
*/
#define     REG_TMR_TCSR0		(TMR_BA+0x00)  /* Timer Control and Status Register 0 */
#define     REG_TMR_TICR0		(TMR_BA+0x04)  /* Timer Initial Control Register 0 */
#define     REG_TMR_TDR0		(TMR_BA+0x08)  /* Timer Data Register 0 */
#define     REG_TMR_TCSR1		(TMR_BA+0x10)  /* Timer Control and Status Register 1 */
#define     REG_TMR_TICR1		(TMR_BA+0x14)  /* Timer Initial Control Register 1 */
#define     REG_TMR_TDR1		(TMR_BA+0x18)  /* Timer Data Register 1 */
#define     REG_TMR_TCSR2		(TMR_BA+0x20)  /* Timer Control and Status Register 2 */
#define     REG_TMR_TICR2		(TMR_BA+0x24)  /* Timer Initial Control Register 2 */
#define     REG_TMR_TDR2		(TMR_BA+0x28)  /* Timer Data Register 2 */
#define     REG_TMR_TCSR3		(TMR_BA+0x30)  /* Timer Control and Status Register 3 */
#define     REG_TMR_TICR3		(TMR_BA+0x34)  /* Timer Initial Control Register 3 */
#define     REG_TMR_TDR3		(TMR_BA+0x38)  /* Timer Data Register 3 */
#define     REG_TMR_TCSR4		(TMR_BA+0x40)  /* Timer Control and Status Register 4 */
#define     REG_TMR_TICR4		(TMR_BA+0x44)  /* Timer Initial Control Register 4 */
#define     REG_TMR_TDR4		(TMR_BA+0x48)  /* Timer Data Register 4 */
#define     REG_TMR_TISR		(TMR_BA+0x60)  /* Timer Interrupt Status Register */

#define     rTMR_TCSR0			(*(unsigned int volatile *)REG_TMR_TCSR0)
#define     rTMR_TICR0			(*(unsigned int volatile *)REG_TMR_TICR0)
#define     rTMR_TDR0			(*(unsigned int volatile *)REG_TMR_TDR0)
#define     rTMR_TCSR1			(*(unsigned int volatile *)REG_TMR_TCSR1)
#define     rTMR_TICR1			(*(unsigned int volatile *)REG_TMR_TICR1)
#define     rTMR_TDR1			(*(unsigned int volatile *)REG_TMR_TDR1)
#define     rTMR_TCSR2			(*(unsigned int volatile *)REG_TMR_TCSR2)
#define     rTMR_TICR2			(*(unsigned int volatile *)REG_TMR_TICR2)
#define     rTMR_TDR2			(*(unsigned int volatile *)REG_TMR_TDR2)
#define     rTMR_TCSR3			(*(unsigned int volatile *)REG_TMR_TCSR3)
#define     rTMR_TICR3			(*(unsigned int volatile *)REG_TMR_TICR3)
#define     rTMR_TDR3			(*(unsigned int volatile *)REG_TMR_TDR3)
#define     rTMR_TCSR4			(*(unsigned int volatile *)REG_TMR_TCSR4)
#define     rTMR_TICR4			(*(unsigned int volatile *)REG_TMR_TICR4)
#define     rTMR_TDR4			(*(unsigned int volatile *)REG_TMR_TDR4)
#define     rTMR_TISR			(*(unsigned int volatile *)REG_TMR_TISR)


/*
  Watch Dog Timer Registers 
*/  
#define REG_WDT_CR				(WDT_BA + 0x00)	/* WDT control register */
#define REG_WDT_CRALT			(WDT_BA + 0x04)	/* WDT alternative control register */

#define rWDT_CR					(*(unsigned int volatile *)REG_WDT_CR)
#define rWDT_CRALT				(*(unsigned int volatile *)REG_WDT_CRALT)


/*
  Window Watch Dog Timer Registers 
*/  
#define REG_WWDT_RLD			(WWDT_BA + 0x00)	/* WWDT reload counter register */
#define REG_WWDT_CR				(WWDT_BA + 0x04)	/* WWDT control register */
#define REG_WWDT_SR				(WWDT_BA + 0x08)	/* WWDT status register */
#define REG_WWDT_CVR			(WWDT_BA + 0x0c)	/* WWDT counter value register */

#define rWWDT_RLD				(*(unsigned int volatile *)REG_WWDT_RLD)
#define rWWDT_CR				(*(unsigned int volatile *)REG_WWDT_CR)
#define rWWDT_SR				(*(unsigned int volatile *)REG_WWDT_SR)
#define rWWDT_CVR				(*(unsigned int volatile *)REG_WWDT_CVR)



