OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  Advance Interrupt Controller (AIC) Registers
*/
#define     REG_AIC_SCR1    (AIC_BA+0x00)    /* Source control register 1 */
#define     REG_AIC_SCR2    (AIC_BA+0x04)    /* Source control register 2 */
#define     REG_AIC_SCR3    (AIC_BA+0x08)    /* Source control register 3 */
#define     REG_AIC_SCR4    (AIC_BA+0x0C)    /* Source control register 4 */
#define     REG_AIC_SCR5    (AIC_BA+0x10)    /* Source control register 5 */
#define     REG_AIC_SCR6    (AIC_BA+0x14)    /* Source control register 6 */
#define     REG_AIC_SCR7    (AIC_BA+0x18)    /* Source control register 7 */
#define     REG_AIC_SCR8    (AIC_BA+0x1C)    /* Source control register 8 */
#define     REG_AIC_SCR9    (AIC_BA+0x20)    /* Source control register 9 */
#define     REG_AIC_SCR10   (AIC_BA+0x24)    /* Source control register 10 */
#define     REG_AIC_SCR11   (AIC_BA+0x28)    /* Source control register 11 */
#define     REG_AIC_SCR12   (AIC_BA+0x2C)    /* Source control register 12 */
#define     REG_AIC_SCR13   (AIC_BA+0x30)    /* Source control register 13 */
#define     REG_AIC_SCR14   (AIC_BA+0x34)    /* Source control register 14 */
#define     REG_AIC_SCR15   (AIC_BA+0x38)    /* Source control register 15 */
#define     REG_AIC_IRSR    (AIC_BA+0x100)   /* Interrupt raw status register */
#define     REG_AIC_IRSRH   (AIC_BA+0x104)   /* Interrupt raw status register (Hign) */
#define     REG_AIC_IASR    (AIC_BA+0x108)   /* Interrupt active status register */
#define     REG_AIC_IASRH   (AIC_BA+0x10C)   /* Interrupt active status register (Hign) */
#define     REG_AIC_ISR     (AIC_BA+0x110)   /* Interrupt status register */
#define     REG_AIC_ISRH    (AIC_BA+0x114)   /* Interrupt status register (High) */
#define     REG_AIC_IPER    (AIC_BA+0x118)   /* Interrupt priority encoding register */
#define     REG_AIC_ISNR    (AIC_BA+0x120)   /* Interrupt source number register */
#define     REG_AIC_OISR    (AIC_BA+0x124)   /* Output interrupt status register */
#define     REG_AIC_IMR     (AIC_BA+0x128)   /* Interrupt mask register */
#define     REG_AIC_IMRH    (AIC_BA+0x12C)   /* Interrupt mask register (High) */
#define     REG_AIC_MECR    (AIC_BA+0x130)   /* Mask enable command register */
#define     REG_AIC_MECRH   (AIC_BA+0x134)   /* Mask enable command register (High) */
#define     REG_AIC_MDCR    (AIC_BA+0x138)   /* Mask disable command register */
#define     REG_AIC_MDCRH   (AIC_BA+0x13C)   /* Mask disable command register (High) */
#define     REG_AIC_SSCR    (AIC_BA+0x140)   /* Source Set Command Register */
#define     REG_AIC_SSCRH   (AIC_BA+0x144)   /* Source Set Command Register (High) */
#define     REG_AIC_SCCR    (AIC_BA+0x148)   /* Source Clear Command Register */
#define     REG_AIC_SCCRH   (AIC_BA+0x14C)   /* Source Clear Command Register (High) */
#define     REG_AIC_EOSCR   (AIC_BA+0x150)   /* End of service command register */

#define     rAIC_SCR1    (*(unsigned int volatile *)REG_AIC_SCR1)
#define     rAIC_SCR2    (*(unsigned int volatile *)REG_AIC_SCR2)
#define     rAIC_SCR3    (*(unsigned int volatile *)REG_AIC_SCR3)
#define     rAIC_SCR4    (*(unsigned int volatile *)REG_AIC_SCR4)
#define     rAIC_SCR5    (*(unsigned int volatile *)REG_AIC_SCR5)
#define     rAIC_SCR6    (*(unsigned int volatile *)REG_AIC_SCR6)
#define     rAIC_SCR7    (*(unsigned int volatile *)REG_AIC_SCR7)
#define     rAIC_SCR8    (*(unsigned int volatile *)REG_AIC_SCR8)
#define     rAIC_SCR9    (*(unsigned int volatile *)REG_AIC_SCR9)
#define     rAIC_SCR10   (*(unsigned int volatile *)REG_AIC_SCR10)
#define     rAIC_SCR11   (*(unsigned int volatile *)REG_AIC_SCR11)
#define     rAIC_SCR12   (*(unsigned int volatile *)REG_AIC_SCR12)
#define     rAIC_SCR13   (*(unsigned int volatile *)REG_AIC_SCR13)
#define     rAIC_SCR14   (*(unsigned int volatile *)REG_AIC_SCR14)
#define     rAIC_SCR15   (*(unsigned int volatile *)REG_AIC_SCR15)
#define     rAIC_IRQSC   (*(unsigned int volatile *)REG_AIC_IRQSC)
#define     rAIC_GEN     (*(unsigned int volatile *)REG_AIC_GEN)
#define     rAIC_GASR    (*(unsigned int volatile *)REG_AIC_GASR)
#define     rAIC_GSCR    (*(unsigned int volatile *)REG_AIC_GSCR)
#define     rAIC_IRSR    (*(unsigned int volatile *)REG_AIC_IRSR)
#define     rAIC_IRSRH   (*(unsigned int volatile *)REG_AIC_IRSRH)
#define     rAIC_IASR    (*(unsigned int volatile *)REG_AIC_IASR)
#define     rAIC_IASRH   (*(unsigned int volatile *)REG_AIC_IASRH)
#define     rAIC_ISR     (*(unsigned int volatile *)REG_AIC_ISR)
#define     rAIC_ISRH    (*(unsigned int volatile *)REG_AIC_ISRH)
#define     rAIC_IPER    (*(unsigned int volatile *)REG_AIC_IPER)
#define     rAIC_ISNR    (*(unsigned int volatile *)REG_AIC_ISNR)
#define     rAIC_OISR    (*(unsigned int volatile *)REG_AIC_OISR)
#define     rAIC_IMR     (*(unsigned int volatile *)REG_AIC_IMR)
#define     rAIC_IMRH    (*(unsigned int volatile *)REG_AIC_IMRH)
#define     rAIC_MECR    (*(unsigned int volatile *)REG_AIC_MECR)
#define     rAIC_MECRH   (*(unsigned int volatile *)REG_AIC_MECRH)
#define     rAIC_MDCR    (*(unsigned int volatile *)REG_AIC_MDCR)
#define     rAIC_MDCRH   (*(unsigned int volatile *)REG_AIC_MDCRH)
#define     rAIC_SSCR    (*(unsigned int volatile *)REG_AIC_SSCR)
#define     rAIC_SSCRH   (*(unsigned int volatile *)REG_AIC_SSCRH)
#define     rAIC_SCCR    (*(unsigned int volatile *)REG_AIC_SCCR)
#define     rAIC_SCCRH   (*(unsigned int volatile *)REG_AIC_SCCRH)
#define     rAIC_EOSCR   (*(unsigned int volatile *)REG_AIC_EOSCR)


/*
  GPIO Control Registers  
*/
#define     REG_GPIOC_DIR		(GPIO_BA+0x04)  /* GPIO portC direction control register */
#define     REG_GPIOC_DATAOUT	(GPIO_BA+0x08)  /* GPIO portC data output register */
#define     REG_GPIOC_DATAIN	(GPIO_BA+0x0C)  /* GPIO portC data input register */
#define     REG_GPIOD_DIR		(GPIO_BA+0x14)  /* GPIO portD direction control register */
#define     REG_GPIOD_DATAOUT	(GPIO_BA+0x18)  /* GPIO portD data output register */
#define     REG_GPIOD_DATAIN	(GPIO_BA+0x1C)  /* GPIO portD data input register */
#define     REG_GPIOE_DIR		(GPIO_BA+0x24)  /* GPIO portE direction control register */
#define     REG_GPIOE_DATAOUT	(GPIO_BA+0x28)  /* GPIO portE data output register */
#define     REG_GPIOE_DATAIN	(GPIO_BA+0x2C)  /* GPIO portE data input register */
#define     REG_GPIOF_DIR		(GPIO_BA+0x34)  /* GPIO portF direction control register */
#define     REG_GPIOF_DATAOUT	(GPIO_BA+0x38)  /* GPIO portF data output register */
#define     REG_GPIOF_DATAIN	(GPIO_BA+0x3C)  /* GPIO portF data input register */
#define     REG_GPIOG_DIR		(GPIO_BA+0x44)  /* GPIO portG direction control register */
#define     REG_GPIOG_DATAOUT	(GPIO_BA+0x48)  /* GPIO portG data output register */
#define     REG_GPIOG_DATAIN	(GPIO_BA+0x4C)  /* GPIO portG data input register */
#define     REG_GPIOH_DBNCE		(GPIO_BA+0x50)  /* GPIO portH input debounce control reg. */
#define     REG_GPIOH_DIR		(GPIO_BA+0x54)  /* GPIO portH direction control register */
#define     REG_GPIOH_DATAOUT	(GPIO_BA+0x58)  /* GPIO portH data output register */
#define     REG_GPIOH_DATAIN	(GPIO_BA+0x5C)  /* GPIO portH data input register */
#define     REG_GPIOI_DIR		(GPIO_BA+0x64)  /* GPIO portI direction control register */
#define     REG_GPIOI_DATAOU	(GPIO_BA+0x68)  /* GPIO portI data output register */
#define     REG_GPIOI_DATAIN	(GPIO_BA+0x6C)  /* GPIO portI data input register */

#define     rGPIOC_DIR			(*(unsigned int volatile *)REG_GPIOC_DIR)
#define     rGPIOC_DATAOUT		(*(unsigned int volatile *)REG_GPIOC_DATAOUT)
#define     rGPIOC_DATAIN		(*(unsigned int volatile *)REG_GPIOC_DATAIN)
#define     rGPIOD_DIR			(*(unsigned int volatile *)REG_GPIOD_DIR)
#define     rGPIOD_DATAOUT		(*(unsigned int volatile *)REG_GPIOD_DATAOUT)
#define     rGPIOD_DATAIN		(*(unsigned int volatile *)REG_GPIOD_DATAIN)
#define     rGPIOE_DIR			(*(unsigned int volatile *)REG_GPIOE_DIR)
#define     rGPIOE_DATAOUT		(*(unsigned int volatile *)REG_GPIOE_DATAOUT)
#define     rGPIOE_DATAIN		(*(unsigned int volatile *)REG_GPIOE_DATAIN)
#define     rGPIOF_DIR			(*(unsigned int volatile *)REG_GPIOF_DIR)
#define     rGPIOF_DATAOUT		(*(unsigned int volatile *)REG_GPIOF_DATAOUT)
#define     rGPIOF_DATAIN		(*(unsigned int volatile *)REG_GPIOF_DATAIN)
#define     rGPIOG_DIR			(*(unsigned int volatile *)REG_GPIOG_DIR)
#define     rGPIOG_DATAOUT		(*(unsigned int volatile *)REG_GPIOG_DATAOUT)
#define     rGPIOG_DATAIN		(*(unsigned int volatile *)REG_GPIOG_DATAIN)
#define     rGPIOH_DBNCE		(*(unsigned int volatile *)REG_GPIOH_DBNCE)
#define     rGPIOH_DIR			(*(unsigned int volatile *)REG_GPIOH_DIR)
#define     rGPIOH_DATAOUT		(*(unsigned int volatile *)REG_GPIOH_DATAOUT)
#define     rGPIOH_DATAIN		(*(unsigned int volatile *)REG_GPIOH_DATAIN)
#define     rGPIOI_DIR			(*(unsigned int volatile *)REG_GPIOI_DIR)
#define     rGPIOI_DATAOU		(*(unsigned int volatile *)REG_GPIOI_DATAOU)
#define     rGPIOI_DATAIN		(*(unsigned int volatile *)REG_GPIOI_DATAIN)


