OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/* 
  RTC Control Registers
*/
#define     REG_RTC_INIR	(RTC_BA+0x00)   /* RTC Initiation Register */
#define     REG_RTC_AER		(RTC_BA+0x04)   /* RTC Access Enable Register */
#define     REG_RTC_FCR		(RTC_BA+0x08)   /* RTC Frequency Compensation Register */
#define     REG_RTC_TLR		(RTC_BA+0x0C)   /* Time Loading Register */
#define     REG_RTC_CLR		(RTC_BA+0x10)   /* Calendar Loading Register */
#define     REG_RTC_TSSR	(RTC_BA+0x14)   /* Time Scale Selection Register */
#define     REG_RTC_DWR		(RTC_BA+0x18)   /* Day of the Week Register */
#define     REG_RTC_TAR		(RTC_BA+0x1C)   /* Time Alarm Register */
#define     REG_RTC_CAR		(RTC_BA+0x20)   /* Calendar Alarm Register */
#define     REG_RTC_LIR		(RTC_BA+0x24)   /* Leap year Indicator Register */
#define     REG_RTC_RIER	(RTC_BA+0x28)   /* RTC Interrupt Enable Register */
#define     REG_RTC_RIIR	(RTC_BA+0x2C)   /* RTC Interrupt Indicator Register */
#define     REG_RTC_TTR		(RTC_BA+0x30)   /* RTC Time Tick Register */

#define     rRTC_INIR		(*(unsigned int volatile *)REG_RTC_INIR)
#define     rRTC_AER		(*(unsigned int volatile *)REG_RTC_AER)
#define     rRTC_FCR		(*(unsigned int volatile *)REG_RTC_FCR)
#define     rRTC_TLR		(*(unsigned int volatile *)REG_RTC_TLR)
#define     rRTC_CLR		(*(unsigned int volatile *)REG_RTC_CLR)
#define     rRTC_TSSR		(*(unsigned int volatile *)REG_RTC_TSSR)
#define     rRTC_DWR		(*(unsigned int volatile *)REG_RTC_DWR)
#define     rRTC_TAR		(*(unsigned int volatile *)REG_RTC_TAR)
#define     rRTC_CAR		(*(unsigned int volatile *)REG_RTC_CAR)
#define     rRTC_LIR		(*(unsigned int volatile *)REG_RTC_LIR)
#define     rRTC_RIER		(*(unsigned int volatile *)REG_RTC_RIER)
#define     rRTC_RIIR		(*(unsigned int volatile *)REG_RTC_RIIR)
#define     rRTC_TTR		(*(unsigned int volatile *)REG_RTC_TTR)


/*
  SmartCard Controller Registers
*/
#define     REG_SC0_RBR		(SC0_BA+0x000)   /* Receive Buffer Register */
#define     REG_SC0_TBR		(SC0_BA+0x000)   /* Transmit Buffer Register */
#define     REG_SC0_CTL		(SC0_BA+0x004)   /* Control Register */
#define     REG_SC0_ALTCTL	(SC0_BA+0x008)   /* Alternate Control Register */
#define     REG_SC0_EGTR	(SC0_BA+0x00C)   /* Extend Gaurd Time Register */
#define     REG_SC0_FRTMR	(SC0_BA+0x010)   /* Receive Buffer Time Out Register */
#define     REG_SC0_ETUCR	(SC0_BA+0x014)   /* ETU Control Register */
#define     REG_SC0_IER		(SC0_BA+0x018)   /* Interrupt Enable Register */
#define     REG_SC0_ISR		(SC0_BA+0x01C)   /* Interrupt Status Register */
#define     REG_SC0_TRST	(SC0_BA+0x020)   /* Transfer Status Register */
#define     REG_SC0_PINCSR	(SC0_BA+0x024)   /* Pin Control State Register */
#define     REG_SC0_TMR0	(SC0_BA+0x028)   /* Internal Timer Control Register 0 */
#define     REG_SC0_TMR1	(SC0_BA+0x02C)   /* Internal Timer Control Register 1 */
#define     REG_SC0_TMR2	(SC0_BA+0x030)   /* Internal Timer Control Register 2 */
#define     REG_SC0_UACTL	(SC0_BA+0x034)   /* UART Mode Control Register */
#define     REG_SC0_TDRA	(SC0_BA+0x038)   /* Timer Current Data Register A */
#define     REG_SC0_TDRB	(SC0_BA+0x03C)   /* Timer Current Data Register B */

#define     rSC0_RBR		(*(unsigned int volatile *)REG_SC0_RBR)
#define     rSC0_TBR		(*(unsigned int volatile *)REG_SC0_TBR)
#define     rSC0_CTL		(*(unsigned int volatile *)REG_SC0_CTL)
#define     rSC0_ALTCTL		(*(unsigned int volatile *)REG_SC0_ALTCTL)
#define     rSC0_EGTR		(*(unsigned int volatile *)REG_SC0_EGTR)
#define     rSC0_FRTMR		(*(unsigned int volatile *)REG_SC0_FRTMR)
#define     rSC0_ETUCR		(*(unsigned int volatile *)REG_SC0_ETUCR)
#define     rSC0_IER		(*(unsigned int volatile *)REG_SC0_IER)
#define     rSC0_ISR		(*(unsigned int volatile *)REG_SC0_ISR)
#define     rSC0_TRST		(*(unsigned int volatile *)REG_SC0_TRST)
#define     rSC0_PINCSR		(*(unsigned int volatile *)REG_SC0_PINCSR)
#define     rSC0_TMR0		(*(unsigned int volatile *)REG_SC0_TMR0)
#define     rSC0_TMR1		(*(unsigned int volatile *)REG_SC0_TMR1)
#define     rSC0_TMR2		(*(unsigned int volatile *)REG_SC0_TMR2)
#define     rSC0_UACTL		(*(unsigned int volatile *)REG_SC0_UACTL)
#define     rSC0_TDRA		(*(unsigned int volatile *)REG_SC0_TDRA)
#define     rSC0_TDRB		(*(unsigned int volatile *)REG_SC0_TDRB)


#define     REG_SC1_RBR		(SC1_BA+0x000)   /* Receive Buffer Register */
#define     REG_SC1_TBR		(SC1_BA+0x000)   /* Transmit Buffer Register */
#define     REG_SC1_CTL		(SC1_BA+0x004)   /* Control Register */
#define     REG_SC1_ALTCTL	(SC1_BA+0x008)   /* Alternate Control Register */
#define     REG_SC1_EGTR	(SC1_BA+0x00C)   /* Extend Gaurd Time Register */
#define     REG_SC1_FRTMR	(SC1_BA+0x010)   /* Receive Buffer Time Out Register */
#define     REG_SC1_ETUCR	(SC1_BA+0x014)   /* ETU Control Register */
#define     REG_SC1_IER		(SC1_BA+0x018)   /* Interrupt Enable Register */
#define     REG_SC1_ISR		(SC1_BA+0x01C)   /* Interrupt Status Register */
#define     REG_SC1_TRST	(SC1_BA+0x020)   /* Transfer Status Register */
#define     REG_SC1_PINCSR	(SC1_BA+0x024)   /* Pin Control State Register */
#define     REG_SC1_TMR0	(SC1_BA+0x028)   /* Internal Timer Control Register 0 */
#define     REG_SC1_TMR1	(SC1_BA+0x02C)   /* Internal Timer Control Register 1 */
#define     REG_SC1_TMR2	(SC1_BA+0x030)   /* Internal Timer Control Register 2 */
#define     REG_SC1_UACTL	(SC1_BA+0x034)   /* UART Mode Control Register */
#define     REG_SC1_TDRA	(SC1_BA+0x038)   /* Timer Current Data Register A */
#define     REG_SC1_TDRB	(SC1_BA+0x03C)   /* Timer Current Data Register B */

#define     rSC1_RBR		(*(unsigned int volatile *)REG_SC1_RBR)
#define     rSC1_TBR		(*(unsigned int volatile *)REG_SC1_TBR)
#define     rSC1_CTL		(*(unsigned int volatile *)REG_SC1_CTL)
#define     rSC1_ALTCTL		(*(unsigned int volatile *)REG_SC1_ALTCTL)
#define     rSC1_EGTR		(*(unsigned int volatile *)REG_SC1_EGTR)
#define     rSC1_FRTMR		(*(unsigned int volatile *)REG_SC1_FRTMR)
#define     rSC1_ETUCR		(*(unsigned int volatile *)REG_SC1_ETUCR)
#define     rSC1_IER		(*(unsigned int volatile *)REG_SC1_IER)
#define     rSC1_ISR		(*(unsigned int volatile *)REG_SC1_ISR)
#define     rSC1_TRST		(*(unsigned int volatile *)REG_SC1_TRST)
#define     rSC1_PINCSR		(*(unsigned int volatile *)REG_SC1_PINCSR)
#define     rSC1_TMR0		(*(unsigned int volatile *)REG_SC1_TMR0)
#define     rSC1_TMR1		(*(unsigned int volatile *)REG_SC1_TMR1)
#define     rSC1_TMR2		(*(unsigned int volatile *)REG_SC1_TMR2)
#define     rSC1_UACTL		(*(unsigned int volatile *)REG_SC1_UACTL)
#define     rSC1_TDRA		(*(unsigned int volatile *)REG_SC1_TDRA)
#define     rSC1_TDRB		(*(unsigned int volatile *)REG_SC1_TDRB)


