OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  I2C 0 Control Registers
*/
#define     REG_IIC0_CS			(I2C0_BA+0x00)  /* Control and Status Register */
#define     REG_IIC0_DIVIDER	(I2C0_BA+0x04)  /* Clock Prescale Register */
#define     REG_IIC0_CMDR		(I2C0_BA+0x08)  /* Command Register */
#define     REG_IIC0_SWR		(I2C0_BA+0x0C)  /* Software Mode Control Register */
#define     REG_IIC0_RxR		(I2C0_BA+0x10)  /* Data Receive Register */
#define     REG_IIC0_TxR		(I2C0_BA+0x14)  /* Data Transmit Register */

#define     rIIC0_CS			(*(unsigned int volatile *)REG_IIC0_CS)
#define     rIIC0_DIVIDER		(*(unsigned int volatile *)REG_IIC0_DIVIDER)
#define     rIIC0_CMDR			(*(unsigned int volatile *)REG_IIC0_CMDR)
#define     rIIC0_SWR			(*(unsigned int volatile *)REG_IIC0_SWR)
#define     rIIC0_RxR			(*(unsigned int volatile *)REG_IIC0_RxR)
#define     rIIC0_TxR			(*(unsigned int volatile *)REG_IIC0_TxR)


/*
  I2C 1 Control Registers
*/
#define     REG_IIC1_CS			(I2C1_BA+0x00)  /* Control and Status Register */
#define     REG_IIC1_DIVIDER	(I2C1_BA+0x04)  /* Clock Prescale Register */
#define     REG_IIC1_CMDR		(I2C1_BA+0x08)  /* Command Register */
#define     REG_IIC1_SWR		(I2C1_BA+0x0C)  /* Software Mode Control Register */
#define     REG_IIC1_RxR		(I2C1_BA+0x10)  /* Data Receive Register */
#define     REG_IIC1_TxR		(I2C1_BA+0x14)  /* Data Transmit Register */

#define     rIIC1_CS			(*(unsigned int volatile *)REG_IIC1_CS)
#define     rIIC1_DIVIDER		(*(unsigned int volatile *)REG_IIC1_DIVIDER)
#define     rIIC1_CMDR			(*(unsigned int volatile *)REG_IIC1_CMDR)
#define     rIIC1_SWR			(*(unsigned int volatile *)REG_IIC1_SWR)
#define     rIIC1_RxR			(*(unsigned int volatile *)REG_IIC1_RxR)
#define     rIIC1_TxR			(*(unsigned int volatile *)REG_IIC1_TxR)


/* 
  USI Control Registers
*/
#define     REG_USI_CNTRL	(USI_BA+0x00)  /* Control and Status Register */
#define     REG_USI_DIVIDER	(USI_BA+0x04)  /* Clock Divider Register */
#define     REG_USI_SSR		(USI_BA+0x08)  /* Slave Select Register */
#define     REG_USI_Rx0		(USI_BA+0x10)  /* Data Receive Register 0 */
#define     REG_USI_Rx1		(USI_BA+0x14)  /* Data Receive Register 1 */
#define     REG_USI_Rx2		(USI_BA+0x18)  /* Data Receive Register 2 */
#define     REG_USI_Rx3		(USI_BA+0x1C)  /* Data Receive Register 3 */
#define     REG_USI_Tx0		(USI_BA+0x10)  /* Data Transmit Register 0 */
#define     REG_USI_Tx1		(USI_BA+0x14)  /* Data Transmit Register 1 */
#define     REG_USI_Tx2		(USI_BA+0x18)  /* Data Transmit Register 2 */
#define     REG_USI_Tx3		(USI_BA+0x1C)  /* Data Transmit Register 3 */

#define     rUSI_CNTRL		(*(unsigned int volatile *)REG_USI_CNTRL)
#define     rUSI_DIVIDER	(*(unsigned int volatile *)REG_USI_DIVIDER)
#define     rUSI_SSR		(*(unsigned int volatile *)REG_USI_SSR)
#define     rUSI_Rx0		(*(unsigned int volatile *)REG_USI_Rx0)
#define     rUSI_Rx1		(*(unsigned int volatile *)REG_USI_Rx1)
#define     rUSI_Rx2		(*(unsigned int volatile *)REG_USI_Rx2)
#define     rUSI_Rx3		(*(unsigned int volatile *)REG_USI_Rx3)
#define     rUSI_Tx0		(*(unsigned int volatile *)REG_USI_Tx0)
#define     rUSI_Tx1		(*(unsigned int volatile *)REG_USI_Tx1)
#define     rUSI_Tx2		(*(unsigned int volatile *)REG_USI_Tx2)
#define     rUSI_Tx3		(*(unsigned int volatile *)REG_USI_Tx3)


/*
  PWM Control Registers
*/
#define     REG_PWM_PPR		(PWM_BA+0x00)  /* PWM Pre-scale Register 0 */
#define     REG_PWM_CSR		(PWM_BA+0x04)  /* PWM Clock Select Register */
#define     REG_PWM_PCR		(PWM_BA+0x08)  /* PWM Control Register */
#define     REG_PWM_CNR0	(PWM_BA+0x0C)  /* PWM Counter Register 0 */
#define     REG_PWM_CMR0	(PWM_BA+0x10)  /* PWM Comparator Register 0 */
#define     REG_PWM_PDR0	(PWM_BA+0x14)  /* PWM Data Register 0 */
#define     REG_PWM_CNR1	(PWM_BA+0x18)  /* PWM Counter Register 1 */
#define     REG_PWM_CMR1	(PWM_BA+0x1C)  /* PWM Comparator Register 1 */
#define     REG_PWM_PDR1	(PWM_BA+0x20)  /* PWM Data Register 1 */
#define     REG_PWM_CNR2	(PWM_BA+0x24)  /* PWM Counter Register 2 */
#define     REG_PWM_CMR2	(PWM_BA+0x28)  /* PWM Comparator Register 2 */
#define     REG_PWM_PDR2	(PWM_BA+0x2C)  /* PWM Data Register 2 */
#define     REG_PWM_CNR3	(PWM_BA+0x30)  /* PWM Counter Register 3 */
#define     REG_PWM_CMR3	(PWM_BA+0x34)  /* PWM Comparator Register 3 */
#define     REG_PWM_PDR3	(PWM_BA+0x38)  /* PWM Data Register 3 */
#define     REG_PWM_PIER	(PWM_BA+0x3C)  /* PWM Timer Interrupt Enable Register */
#define     REG_PWM_PIIR	(PWM_BA+0x40)  /* PWM Timer Interrupt Identification Register */

#define     rPWM_PPR		(*(unsigned int volatile *)REG_PWM_PPR)
#define     rPWM_CSR		(*(unsigned int volatile *)REG_PWM_CSR)
#define     rPWM_PCR		(*(unsigned int volatile *)REG_PWM_PCR)
#define     rPWM_CNR0		(*(unsigned int volatile *)REG_PWM_CNR0)
#define     rPWM_CMR0		(*(unsigned int volatile *)REG_PWM_CMR0)
#define     rPWM_PDR0		(*(unsigned int volatile *)REG_PWM_PDR0)
#define     rPWM_CNR1		(*(unsigned int volatile *)REG_PWM_CNR1)
#define     rPWM_CMR1		(*(unsigned int volatile *)REG_PWM_CMR1)
#define     rPWM_PDR1		(*(unsigned int volatile *)REG_PWM_PDR1)
#define     rPWM_CNR2		(*(unsigned int volatile *)REG_PWM_CNR2)
#define     rPWM_CMR2		(*(unsigned int volatile *)REG_PWM_CMR2)
#define     rPWM_PDR2		(*(unsigned int volatile *)REG_PWM_PDR2)
#define     rPWM_CNR3		(*(unsigned int volatile *)REG_PWM_CNR3)
#define     rPWM_CMR3		(*(unsigned int volatile *)REG_PWM_CMR3)
#define     rPWM_PDR3		(*(unsigned int volatile *)REG_PWM_PDR3)
#define     rPWM_PIER		(*(unsigned int volatile *)REG_PWM_PIER)
#define     rPWM_PIIR		(*(unsigned int volatile *)REG_PWM_PIIR)


/*
  KPI Control Registers
*/
#define     REG_KPI_CONF	(KPI_BA+0x00)  /* Keypad controller configuration Register */
#define     REG_KPI_3KCONF	(KPI_BA+0x04)  /* Keypad controller 3-keys configuration register */
#define     REG_KPI_LPCONF	(KPI_BA+0x08)  /* Keypad controller low power configuration register */
#define     REG_KPI_STATUS	(KPI_BA+0x0C)  /* Keypad controller status register */

#define     rKPI_CONF	(*(unsigned int volatile *)REG_KPI_CONF)
#define     rKPI_3KCONF	(*(unsigned int volatile *)REG_KPI_3KCONF)
#define     rKPI_LPCONF	(*(unsigned int volatile *)REG_KPI_LPCONF)
#define     rKPI_STATUS	(*(unsigned int volatile *)REG_KPI_STATUS)


