OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  PS2 Control Registers
*/
#define     REG_PS2_CMD0		(PS2_BA+0x000)  /* PS2 port 0 Host Controller Command Register */
#define     REG_PS2_STS0		(PS2_BA+0x004)  /* PS2 port 0 Host Controller Status Register */
#define     REG_PS2_SCANCODE0	(PS2_BA+0x008)  /* PS2 port 0 Host Controller Rx Scan Code Register */
#define     REG_PS2_ASCII0		(PS2_BA+0x00C)  /* PS2 port 0 Host Controller Rx ASCII Code */
#define     REG_PS2_CMD1		(PS2_BA+0x100)  /* PS2 port 1 Host Controller Command Register */
#define     REG_PS2_STS1		(PS2_BA+0x104)  /* PS2 port 1 Host Controller Status Register */
#define     REG_PS2_SCANCODE1	(PS2_BA+0x108)  /* PS2 port 1 Host Controller Rx Scan Code Register */
#define     REG_PS2_ASCII1		(PS2_BA+0x10C)  /* PS2 port 1 Host Controller Rx ASCII Code */
 
#define     rPS2_CMD0			(*(unsigned int volatile *)REG_PS2_CMD0)
#define     rPS2_STS0			(*(unsigned int volatile *)REG_PS2_STS0)
#define     rPS2_SCANCODE0		(*(unsigned int volatile *)REG_PS2_SCANCODE0)
#define     rPS2_ASCII0			(*(unsigned int volatile *)REG_PS2_ASCII0)
#define     rPS2_CMD1			(*(unsigned int volatile *)REG_PS2_CMD1)
#define     rPS2_STS1			(*(unsigned int volatile *)REG_PS2_STS1)
#define     rPS2_SCANCODE1		(*(unsigned int volatile *)REG_PS2_SCANCODE1)
#define     rPS2_ASCII1			(*(unsigned int volatile *)REG_PS2_ASCII1)
 
 
/*
  ADC Control Registers
*/
#define     REG_ADC_CON		(ADC_BA+0x00)  /* ADC control register */
#define     REG_ADC_TSC		(ADC_BA+0x04)  /* Touch screen control register */
#define     REG_ADC_DLY		(ADC_BA+0x08)  /* ADC delay register */
#define     REG_ADC_XDATA	(ADC_BA+0x0C)  /* ADC XDATA register */
#define     REG_ADC_YDATA	(ADC_BA+0x10)  /* ADC YDATA register */
#define     REG_ADC_LV_CON	(ADC_BA+0x14)  /* Low Voltage Detector Control register */
#define     REG_ADC_LV_STS	(ADC_BA+0x18)  /* Low Voltage Detector Status register */

#define     rADC_CON		(*(unsigned int volatile *)REG_ADC_CON)
#define     rADC_TSC		(*(unsigned int volatile *)REG_ADC_TSC)
#define     rADC_DLY		(*(unsigned int volatile *)REG_ADC_DLY)
#define     rADC_XDATA		(*(unsigned int volatile *)REG_ADC_XDATA)
#define     rADC_YDATA		(*(unsigned int volatile *)REG_ADC_YDATA)
#define     rADC_LV_CON		(*(unsigned int volatile *)REG_ADC_LV_CON)
#define     rADC_LV_STS		(*(unsigned int volatile *)REG_ADC_LV_STS)


/*
  CAN0 Control Register
*/
#define     REG_CAN0_CON		(CAN0_BA+0x00)  /* Control register */
#define     REG_CAN0_STATUS		(CAN0_BA+0x04)  /* Status register */
#define     REG_CAN0_ERR		(CAN0_BA+0x08)  /* Error Counter */
#define     REG_CAN0_BTIME		(CAN0_BA+0x0C)  /* Bit Timing register */
#define     REG_CAN0_IIDR		(CAN0_BA+0x10)  /* Interrupt Identifier register */
#define     REG_CAN0_TEST		(CAN0_BA+0x14)  /* Test register */
#define     REG_CAN0_BRPE		(CAN0_BA+0x18)  /* BRP Extension register */
#define     REG_CAN0_IF1_CREQ	(CAN0_BA+0x20)  /* IF1 Command Request register */
#define     REG_CAN0_IF2_CREQ	(CAN0_BA+0x80)  /* IF2 Command Request register */
#define     REG_CAN0_IF1_CMASK	(CAN0_BA+0x24)  /* IF1 Command Mask register */
#define     REG_CAN0_IF2_CMASK	(CAN0_BA+0x84)  /* IF2 Command Mask register */
#define     REG_CAN0_IF1_MASK1	(CAN0_BA+0x28)  /* IF1 Mask 1 register */
#define     REG_CAN0_IF2_MASK1	(CAN0_BA+0x88)  /* IF2 Mask 1 register */
#define     REG_CAN0_IF1_MASK2	(CAN0_BA+0x2C)  /* IF1 Mask 2 register */
#define     REG_CAN0_IF2_MASK2	(CAN0_BA+0x8C)  /* IF2 Mask 2 register */
#define     REG_CAN0_IF1_ARB1	(CAN0_BA+0x30)  /* IF1 Arbitration 1 register */
#define     REG_CAN0_IF2_ARB1	(CAN0_BA+0x90)  /* IF2 Arbitration 1 register */
#define     REG_CAN0_IF1_ARB2	(CAN0_BA+0x34)  /* IF1 Arbitration 2 register */
#define     REG_CAN0_IF2_ARB2	(CAN0_BA+0x94)  /* IF2 Arbitration 2 register */
#define     REG_CAN0_IF1_MCON	(CAN0_BA+0x38)  /* IF1 Message Control register */
#define     REG_CAN0_IF2_MCON	(CAN0_BA+0x98)  /* IF2 Message Control register */
#define     REG_CAN0_IF1_DAT_A1	(CAN0_BA+0x3C)  /* IF1 Data A1 register */
#define     REG_CAN0_IF1_DAT_A2	(CAN0_BA+0x40)  /* IF1 Data A2 register */
#define     REG_CAN0_IF1_DAT_B1	(CAN0_BA+0x44)  /* IF1 Data B1 register */
#define     REG_CAN0_IF1_DAT_B2	(CAN0_BA+0x48)  /* IF1 Data B2 register */
#define     REG_CAN0_IF2_DAT_A1	(CAN0_BA+0x9C)  /* IF2 Data A1 register */
#define     REG_CAN0_IF2_DAT_A2	(CAN0_BA+0xA0)  /* IF2 Data A2 register */
#define     REG_CAN0_IF2_DAT_B1	(CAN0_BA+0xA4)  /* IF2 Data B1 register */
#define     REG_CAN0_IF2_DAT_B2	(CAN0_BA+0xA8)  /* IF2 Data B2 register */
#define     REG_CAN0_TXREQ1		(CAN0_BA+0x100) /* Transmission Request 1 */
#define     REG_CAN0_TXREQ2		(CAN0_BA+0x104) /* Transmission Request 2 */
#define     REG_CAN0_NDAT1		(CAN0_BA+0x120) /* New Data Registers 1 */
#define     REG_CAN0_NDAT2		(CAN0_BA+0x124) /* New Data Registers 2 */
#define     REG_CAN0_IPND1		(CAN0_BA+0x140) /* Interrupt Pending Registers 1 */
#define     REG_CAN0_IPND2		(CAN0_BA+0x144) /* Interrupt Pending Registers 2 */
#define     REG_CAN0_MVLD1		(CAN0_BA+0x160) /* Message Valid Registers 1 */
#define     REG_CAN0_MVLD2		(CAN0_BA+0x164) /* Message Valid Registers 2 */
#define     REG_CAN0_WU_EN		(CAN0_BA+0x168) /* Wake Up Function Enable */
#define     REG_CAN0_WU_STATUS	(CAN0_BA+0x16C) /* Wake Up Function Status */

#define     rCAN0_CON			(*(unsigned int volatile *)REG_CAN0_CON)
#define     rCAN0_STATUS		(*(unsigned int volatile *)REG_CAN0_STATUS)
#define     rCAN0_ERR			(*(unsigned int volatile *)REG_CAN0_ERR)
#define     rCAN0_BTIME			(*(unsigned int volatile *)REG_CAN0_BTIME)
#define     rCAN0_IIDR			(*(unsigned int volatile *)REG_CAN0_IIDR)
#define     rCAN0_TEST			(*(unsigned int volatile *)REG_CAN0_TEST)
#define     rCAN0_BRPE			(*(unsigned int volatile *)REG_CAN0_BRPE)
#define     rCAN0_IF1_CREQ		(*(unsigned int volatile *)REG_CAN0_IF1_CREQ)
#define     rCAN0_IF2_CREQ		(*(unsigned int volatile *)REG_CAN0_IF2_CREQ)
#define     rCAN0_IF1_CMASK		(*(unsigned int volatile *)REG_CAN0_IF1_CMASK)
#define     rCAN0_IF2_CMASK		(*(unsigned int volatile *)REG_CAN0_IF2_CMASK)
#define     rCAN0_IF1_MASK1		(*(unsigned int volatile *)REG_CAN0_IF1_MASK1)
#define     rCAN0_IF2_MASK1		(*(unsigned int volatile *)REG_CAN0_IF2_MASK1)
#define     rCAN0_IF1_MASK2		(*(unsigned int volatile *)REG_CAN0_IF1_MASK2)
#define     rCAN0_IF2_MASK2		(*(unsigned int volatile *)REG_CAN0_IF2_MASK2)
#define     rCAN0_IF1_ARB1		(*(unsigned int volatile *)REG_CAN0_IF1_ARB1)
#define     rCAN0_IF2_ARB1		(*(unsigned int volatile *)REG_CAN0_IF2_ARB1)
#define     rCAN0_IF1_ARB2		(*(unsigned int volatile *)REG_CAN0_IF1_ARB2)
#define     rCAN0_IF2_ARB2		(*(unsigned int volatile *)REG_CAN0_IF2_ARB2)
#define     rCAN0_IF1_MCON		(*(unsigned int volatile *)REG_CAN0_IF1_MCON)
#define     rCAN0_IF2_MCON		(*(unsigned int volatile *)REG_CAN0_IF2_MCON)
#define     rCAN0_IF1_DAT_A1	(*(unsigned int volatile *)REG_CAN0_IF1_DAT_A1)
#define     rCAN0_IF1_DAT_A2	(*(unsigned int volatile *)REG_CAN0_IF1_DAT_A2)
#define     rCAN0_IF1_DAT_B1	(*(unsigned int volatile *)REG_CAN0_IF1_DAT_B1)
#define     rCAN0_IF1_DAT_B2	(*(unsigned int volatile *)REG_CAN0_IF1_DAT_B2)
#define     rCAN0_IF2_DAT_A1	(*(unsigned int volatile *)REG_CAN0_IF2_DAT_A1)
#define     rCAN0_IF2_DAT_A2	(*(unsigned int volatile *)REG_CAN0_IF2_DAT_A2)
#define     rCAN0_IF2_DAT_B1	(*(unsigned int volatile *)REG_CAN0_IF2_DAT_B1)
#define     rCAN0_IF2_DAT_B2	(*(unsigned int volatile *)REG_CAN0_IF2_DAT_B2)
#define     rCAN0_TXREQ1		(*(unsigned int volatile *)REG_CAN0_TXREQ1)
#define     rCAN0_TXREQ2		(*(unsigned int volatile *)REG_CAN0_TXREQ2)
#define     rCAN0_NDAT1			(*(unsigned int volatile *)REG_CAN0_NDAT1)
#define     rCAN0_NDAT2			(*(unsigned int volatile *)REG_CAN0_NDAT2)
#define     rCAN0_IPND1			(*(unsigned int volatile *)REG_CAN0_IPND1)
#define     rCAN0_IPND2			(*(unsigned int volatile *)REG_CAN0_IPND2)
#define     rCAN0_MVLD1			(*(unsigned int volatile *)REG_CAN0_MVLD1)
#define     rCAN0_MVLD2			(*(unsigned int volatile *)REG_CAN0_MVLD2)
#define     rCAN0_WU_EN			(*(unsigned int volatile *)REG_CAN0_WU_EN)
#define     rCAN0_WU_STATUS		(*(unsigned int volatile *)REG_CAN0_WU_STATUS)

