OpenNuvoton/NUC970_NuWriter/NuWriterFW/SYSLIB/Lib/NUC970_reg.h
/*
  CAN1 Control Register
*/
#define     REG_CAN1_CON		(CAN1_BA+0x00)  /* Control register */
#define     REG_CAN1_STATUS		(CAN1_BA+0x04)  /* Status register */
#define     REG_CAN1_ERR		(CAN1_BA+0x08)  /* Error Counter */
#define     REG_CAN1_BTIME		(CAN1_BA+0x0C)  /* Bit Timing register */
#define     REG_CAN1_IIDR		(CAN1_BA+0x10)  /* Interrupt Identifier register */
#define     REG_CAN1_TEST		(CAN1_BA+0x14)  /* Test register */
#define     REG_CAN1_BRPE		(CAN1_BA+0x18)  /* BRP Extension register */
#define     REG_CAN1_IF1_CREQ	(CAN1_BA+0x20)  /* IF1 Command Request register */
#define     REG_CAN1_IF2_CREQ	(CAN1_BA+0x80)  /* IF2 Command Request register */
#define     REG_CAN1_IF1_CMASK	(CAN1_BA+0x24)  /* IF1 Command Mask register */
#define     REG_CAN1_IF2_CMASK	(CAN1_BA+0x84)  /* IF2 Command Mask register */
#define     REG_CAN1_IF1_MASK1	(CAN1_BA+0x28)  /* IF1 Mask 1 register */
#define     REG_CAN1_IF2_MASK1	(CAN1_BA+0x88)  /* IF2 Mask 1 register */
#define     REG_CAN1_IF1_MASK2	(CAN1_BA+0x2C)  /* IF1 Mask 2 register */
#define     REG_CAN1_IF2_MASK2	(CAN1_BA+0x8C)  /* IF2 Mask 2 register */
#define     REG_CAN1_IF1_ARB1	(CAN1_BA+0x30)  /* IF1 Arbitration 1 register */
#define     REG_CAN1_IF2_ARB1	(CAN1_BA+0x90)  /* IF2 Arbitration 1 register */
#define     REG_CAN1_IF1_ARB2	(CAN1_BA+0x34)  /* IF1 Arbitration 2 register */
#define     REG_CAN1_IF2_ARB2	(CAN1_BA+0x94)  /* IF2 Arbitration 2 register */
#define     REG_CAN1_IF1_MCON	(CAN1_BA+0x38)  /* IF1 Message Control register */
#define     REG_CAN1_IF2_MCON	(CAN1_BA+0x98)  /* IF2 Message Control register */
#define     REG_CAN1_IF1_DAT_A1	(CAN1_BA+0x3C)  /* IF1 Data A1 register */
#define     REG_CAN1_IF1_DAT_A2	(CAN1_BA+0x40)  /* IF1 Data A2 register */
#define     REG_CAN1_IF1_DAT_B1	(CAN1_BA+0x44)  /* IF1 Data B1 register */
#define     REG_CAN1_IF1_DAT_B2	(CAN1_BA+0x48)  /* IF1 Data B2 register */
#define     REG_CAN1_IF2_DAT_A1	(CAN1_BA+0x9C)  /* IF2 Data A1 register */
#define     REG_CAN1_IF2_DAT_A2	(CAN1_BA+0xA0)  /* IF2 Data A2 register */
#define     REG_CAN1_IF2_DAT_B1	(CAN1_BA+0xA4)  /* IF2 Data B1 register */
#define     REG_CAN1_IF2_DAT_B2	(CAN1_BA+0xA8)  /* IF2 Data B2 register */
#define     REG_CAN1_TXREQ1		(CAN1_BA+0x100) /* Transmission Request 1 */
#define     REG_CAN1_TXREQ2		(CAN1_BA+0x104) /* Transmission Request 2 */
#define     REG_CAN1_NDAT1		(CAN1_BA+0x120) /* New Data Registers 1 */
#define     REG_CAN1_NDAT2		(CAN1_BA+0x124) /* New Data Registers 2 */
#define     REG_CAN1_IPND1		(CAN1_BA+0x140) /* Interrupt Pending Registers 1 */
#define     REG_CAN1_IPND2		(CAN1_BA+0x144) /* Interrupt Pending Registers 2 */
#define     REG_CAN1_MVLD1		(CAN1_BA+0x160) /* Message Valid Registers 1 */
#define     REG_CAN1_MVLD2		(CAN1_BA+0x164) /* Message Valid Registers 2 */
#define     REG_CAN1_WU_EN		(CAN1_BA+0x168) /* Wake Up Function Enable */
#define     REG_CAN1_WU_STATUS	(CAN1_BA+0x16C) /* Wake Up Function Status */

#define     rCAN1_CON			(*(unsigned int volatile *)REG_CAN1_CON)
#define     rCAN1_STATUS		(*(unsigned int volatile *)REG_CAN1_STATUS)
#define     rCAN1_ERR			(*(unsigned int volatile *)REG_CAN1_ERR)
#define     rCAN1_BTIME			(*(unsigned int volatile *)REG_CAN1_BTIME)
#define     rCAN1_IIDR			(*(unsigned int volatile *)REG_CAN1_IIDR)
#define     rCAN1_TEST			(*(unsigned int volatile *)REG_CAN1_TEST)
#define     rCAN1_BRPE			(*(unsigned int volatile *)REG_CAN1_BRPE)
#define     rCAN1_IF1_CREQ		(*(unsigned int volatile *)REG_CAN1_IF1_CREQ)
#define     rCAN1_IF2_CREQ		(*(unsigned int volatile *)REG_CAN1_IF2_CREQ)
#define     rCAN1_IF1_CMASK		(*(unsigned int volatile *)REG_CAN1_IF1_CMASK)
#define     rCAN1_IF2_CMASK		(*(unsigned int volatile *)REG_CAN1_IF2_CMASK)
#define     rCAN1_IF1_MASK1		(*(unsigned int volatile *)REG_CAN1_IF1_MASK1)
#define     rCAN1_IF2_MASK1		(*(unsigned int volatile *)REG_CAN1_IF2_MASK1)
#define     rCAN1_IF1_MASK2		(*(unsigned int volatile *)REG_CAN1_IF1_MASK2)
#define     rCAN1_IF2_MASK2		(*(unsigned int volatile *)REG_CAN1_IF2_MASK2)
#define     rCAN1_IF1_ARB1		(*(unsigned int volatile *)REG_CAN1_IF1_ARB1)
#define     rCAN1_IF2_ARB1		(*(unsigned int volatile *)REG_CAN1_IF2_ARB1)
#define     rCAN1_IF1_ARB2		(*(unsigned int volatile *)REG_CAN1_IF1_ARB2)
#define     rCAN1_IF2_ARB2		(*(unsigned int volatile *)REG_CAN1_IF2_ARB2)
#define     rCAN1_IF1_MCON		(*(unsigned int volatile *)REG_CAN1_IF1_MCON)
#define     rCAN1_IF2_MCON		(*(unsigned int volatile *)REG_CAN1_IF2_MCON)
#define     rCAN1_IF1_DAT_A1	(*(unsigned int volatile *)REG_CAN1_IF1_DAT_A1)
#define     rCAN1_IF1_DAT_A2	(*(unsigned int volatile *)REG_CAN1_IF1_DAT_A2)
#define     rCAN1_IF1_DAT_B1	(*(unsigned int volatile *)REG_CAN1_IF1_DAT_B1)
#define     rCAN1_IF1_DAT_B2	(*(unsigned int volatile *)REG_CAN1_IF1_DAT_B2)
#define     rCAN1_IF2_DAT_A1	(*(unsigned int volatile *)REG_CAN1_IF2_DAT_A1)
#define     rCAN1_IF2_DAT_A2	(*(unsigned int volatile *)REG_CAN1_IF2_DAT_A2)
#define     rCAN1_IF2_DAT_B1	(*(unsigned int volatile *)REG_CAN1_IF2_DAT_B1)
#define     rCAN1_IF2_DAT_B2	(*(unsigned int volatile *)REG_CAN1_IF2_DAT_B2)
#define     rCAN1_TXREQ1		(*(unsigned int volatile *)REG_CAN1_TXREQ1)
#define     rCAN1_TXREQ2		(*(unsigned int volatile *)REG_CAN1_TXREQ2)
#define     rCAN1_NDAT1			(*(unsigned int volatile *)REG_CAN1_NDAT1)
#define     rCAN1_NDAT2			(*(unsigned int volatile *)REG_CAN1_NDAT2)
#define     rCAN1_IPND1			(*(unsigned int volatile *)REG_CAN1_IPND1)
#define     rCAN1_IPND2			(*(unsigned int volatile *)REG_CAN1_IPND2)
#define     rCAN1_MVLD1			(*(unsigned int volatile *)REG_CAN1_MVLD1)
#define     rCAN1_MVLD2			(*(unsigned int volatile *)REG_CAN1_MVLD2)
#define     rCAN1_WU_EN			(*(unsigned int volatile *)REG_CAN1_WU_EN)
#define     rCAN1_WU_STATUS		(*(unsigned int volatile *)REG_CAN1_WU_STATUS)

/**********************************************************************************************************
 *                                                               
 * 24. OTP Control Registers
 *
 **********************************************************************************************************/
#define     REG_OTP_KEYEN	  (OTP_BA+0x00)  /* Key Enable Register */
#define     REG_OTP_OPTION	(OTP_BA+0x0C)  /* OTP Option Register */
#define     REG_OTP_VALUE0	(OTP_BA+0x10)  /* OTP Value 0 Register */
#define     REG_OTP_VALUE1	(OTP_BA+0x14)  /* OTP Value 1 Register */
#define     REG_OTP_VALUE2	(OTP_BA+0x18)  /* OTP Value 2 Register */
#define     REG_OTP_VALUE3	(OTP_BA+0x1C)  /* OTP Value 3 Register */
#define     REG_OTP_VALUE4	(OTP_BA+0x20)  /* OTP Value 4 Register */
#define     REG_OTP_VALUE5	(OTP_BA+0x24)  /* OTP Value 5 Register */
#define     REG_OTP_VALUE6	(OTP_BA+0x28)  /* OTP Value 6 Register */
#define     REG_OTP_VALUE7	(OTP_BA+0x2C)  /* OTP Value 7 Register */
#define     REG_OTP_CYCLE	  (OTP_BA+0x30)  /* Cycle Count Register */
#define     REG_OTP_MODE	  (OTP_BA+0x34)  /* OTP Mode Register */
#define     REG_OTP_START	  (OTP_BA+0x38)  /* OTP Program Start Register */
#define     REG_OTP_STATUS	(OTP_BA+0x40)  /* OTP Status Register */
#define     REG_OTP_PROTECT	(OTP_BA+0x50)  /* OTP Protect Register */


/**********************************************************************************************************
 *                                                               
 * 25. Crypto Engine Control Registers
 *
 **********************************************************************************************************/
#define     REG_CRPT_IPSEC_INT_EN	(CRPT_BA+0x0000)  /* IPsec interrupt enable */
#define     REG_CRPT_IPSEC_INT_FLAG	(CRPT_BA+0x0004)  /* IPsec interrupt flag */
#define     REG_CRPT_AES_CTL		(CRPT_BA+0x0100)  /* AES engine setting */
#define     REG_CRPT_AES_KEY0		(CRPT_BA+0x0110)  /* AES Key Word 0 Register */
#define     REG_CRPT_AES_KEY1		(CRPT_BA+0x0114)  /* AES Key Word 1 Register */
#define     REG_CRPT_AES_KEY2		(CRPT_BA+0x0118)  /* AES Key Word 2 Register */
#define     REG_CRPT_AES_KEY3		(CRPT_BA+0x011C)  /* AES Key Word 3 Register */
#define     REG_CRPT_AES_KEY4		(CRPT_BA+0x0120)  /* AES Key Word 4 Register */
#define     REG_CRPT_AES_KEY5		(CRPT_BA+0x0124)  /* AES Key Word 5 Register */
#define     REG_CRPT_AES_KEY6		(CRPT_BA+0x0128)  /* AES Key Word 6 Register */
#define     REG_CRPT_AES_KEY7		(CRPT_BA+0x012C)  /* AES Key Word 7 Register */
#define     REG_CRPT_AES_IV0		(CRPT_BA+0x0130)  /* AES Initial Vector Word 0 Register */
#define     REG_CRPT_AES_IV1		(CRPT_BA+0x0134)  /* AES Initial Vector Word 1 Register */
#define     REG_CRPT_AES_IV2		(CRPT_BA+0x0138)  /* AES Initial Vector Word 2 Register */
#define     REG_CRPT_AES_IV3		(CRPT_BA+0x013C)  /* AES Initial Vector Word 3 Register */
#define     REG_CRPT_AES_SADR		(CRPT_BA+0x0140)  /* AES Source Address Register */
#define     REG_CRPT_AES_DADR		(CRPT_BA+0x0144)  /* AES Destination Address Register */
#define     REG_CRPT_AES_CNT		(CRPT_BA+0x0148)  /* AES Byte Count Register */


/*! Unlock protected register */
#define UNLOCKREG(x)		do{rREGWRPRTR = 0x59; rREGWRPRTR = 0x16; rREGWRPRTR = 0x88;}while(rREGWRPRTR == 0x00)
/*! Lock protected register */
#define LOCKREG(x)          do{rREGWRPRTR = 0x00;}while(0)

#endif /* _NUC970_H */
